--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\Box\Box Sync\Snuffles Backup\gh8728\Projects\Liquor\Data\Nielsen_Panel\analysis\individual_log
> it_sample.txt
  log type:  text
 opened on:   8 Aug 2017, 09:06:01

. 
. local rebuild_data = 0 // set to 1 to rebuild data from scratch. Very slow

. local J = 250 // number of products to get

. 
. set seed 317596364  // seed taken from random.org

. 
. 
. local years = "2009 2010 2011 2012 2013 2014" // "2008 2009 2010 2011 2012 2013 2014"

. if `rebuild_data' { 
.         /* trimming down UPC file so be smaller so merging is easier */
.         use liquor_upcs
. 
.         /* generating varibles that we want */
.         //dropping unwanted types of products
.         drop if product_module_descr == "COOLERS - REMAINING"
.         drop if product_module_descr == "ALOCOHOLIC COCKTAILS"
. 
.         // Liquor type dummies
.         gen d_g_gin = (product_module_descr == "GIN")
.         gen d_g_vod = (product_module_descr == "VODKA")
.         gen d_g_rum = (product_module_descr == "RUM")
.         gen d_g_sch = (product_module_descr == "SCOTCH")
.         gen d_g_brb = regexm(product_module_descr, "BOURBON")
.         gen d_g_whs = regexm(product_module_descr, "WHISKEY")
.         gen d_g_teq = (product_module_descr == "TEQUILA") 
.         gen d_g_otr = (d_g_gin == 0 & d_g_vod == 0 & d_g_rum == 0 & d_g_sch == 0 & d_g_brb == 0 & d_g_whs ==
>  0 & d_g_teq == 0)
. 
.         // Size dummies
.         gen d_s_375ML = (size1_amount == 375)
.         gen d_s_750ML = (size1_amount == 750)
.         gen d_s_1L = (size1_amount == 1)
.         gen d_s_175L = (size1_amount == 1.75) 
. 
.         /* Generating proof */
.         gen proof = regexs(1) if regexm(upc_descr , "([0-9]?[0-9][0-9][.]?[0-9]?[0-9]?)P")
.         destring proof, replace
. 
.         /* imported flag */
.         gen imported = regexm(upc_descr , " IM ")
.         replace imported = 1 if regexm(upc_descr, " PRD ") & d_g_rum == 1 // PRD is Puerto Rico Distilled
.         replace imported = 1 if d_g_sch == 1 // All scotch is imported
.         replace imported = 1 if d_g_teq == 1 // all tequila is imported
. 
.         // imputing proof for products which the regex didn't work
.         reg proof d_g_* imported, nocons
.         predict proof_hat, xb
.         replace proof = proof_hat if proof == .
. 
.         tempfile small_upc_file
.         save `small_upc_file'
. 
.         foreach year in `years'{
  2.                 
.                 use ny_trips_`year', clear
  3.                 gen NYC = (fips_county_descr == "BRONX" | fips_county_descr == "NEW YORK" | fips_county_d
> escr == "KINGS" | fips_county_descr == "QUEENS" | fips_county_descr == "RICHMOND")
  4.                 //keep if NYC == 1
.                 keep trip_code_uc NYC
  5.                 tempfile tmp_trips
  6.                 save `tmp_trips', replace
  7.                                 
.                 import delimited using "../nielsen_extracts/HMS/`year'/Annual_Files/purchases_`year'.tsv", c
> lear colrange(1:5)
  8.                 
.                 /* first merging in just trip codes to eliminate data set size */
.                 
.                 merge m:1 trip_code_uc using `tmp_trips', gen(_merge_trips) keep(3)
  9.                 drop _merge_trips
 10.                 merge m:1 trip_code_uc using ny_trips_`year', gen(_merge_trips) keep(3)
 11.                 
.                 // Identifying liquor purchases
.                 merge m:1 upc upc_ver_uc using `small_upc_file', gen(_merge_upcs) keep(1 3) // keeps all pur
> chases, drops unused liquor UPCs
 12.                 
.                 //Wine is outside option. Identifying wine purchases
.                 merge m:1 upc upc_ver_uc using wine_upcs, gen(_merge_wine) keep(1 3)
 13.                 
.                 // Keeping just one purchase for non-liquor trips
.                 egen max_merge = max(_merge_upcs), by(trip_code_uc) // largest merge code. Should be 3
 14.                 gen liquor_trip = (max_merge == 3) // trips where one of the UPCs is a liquor UPC
 15.                 drop if liquor_trip == 1 & _merge_upcs == 1 // dropping non-liquor records for liquor tri
> ps
 16.                 
.                 egen max_wine = max(_merge_wine), by(trip_code_uc)
 17.                 gen wine_trip = (max_wine == 3)
 18.                 drop if wine_trip == 0 & liquor_trip == 0 // dropping non wine non liquor trips
 19.                 
.                 bys trip_code_uc: gen trip_order = _n // ordering purchases within trips. Doesn't matter if 
> sort is stable. Just need one record for each non-liquor trip
 20.                 drop if liquor_trip == 0 & trip_order > 1 // dropping additional purchases from non-liquo
> r trips
 21.                 
.                 tempfile obs`year'
 22.                 save `obs`year''
 23.         }
. 
.         clear
. 
.         foreach year in `years'{
  2.                 append using `obs`year''
  3.         }
. 
.         
.         gen date_d = date(purchase_date, "YMD") // daily date
.         format date_d %td
. 
.         gen date_m = mofd(date_d) // monthly date
.         format date_m %tm
.         
.         gen year = year(date_d)
.         //keep if year == 2011
. 
.         gen price = total_price_paid / quantity
. 
.         gen white = (race == 1)
.         gen oldest_age = max(male_head_age, female_head_age)
. 
.         gen choice = 1 // all these records are actual choices
.         keep if d_s_375ML | d_s_750ML | d_s_1L | d_s_175L // keeping only popular size bottles
. 
.         // getting top J UPCs
.         preserve
.                 drop if liquor_trip == 0 // keeping only liquor purchases
.                 contract upc, freq(upc_purchases)
.                 gen rev = -upc_purchases
.                 sort rev
.                 keep in 1/`J' // keeping top J products
.                 gen product = _n
.                 save top_upc_individual, replace
.         restore
. 
.         merge m:1 upc using top_upc_individual, gen(_merge_top) assert(1 3)
. 
.         replace product = 0 if _merge_top == 1 & liquor_trip == 0 // outside option
.         replace product = (`J'+1) if _merge_top == 1 & liquor_trip == 1 // all other products
.         replace product = (`J'+2) if product == (`J'+1) & d_g_vod == 1
.         replace product = (`J'+3) if product == (`J'+1) & d_g_sch == 1
.         replace product = (`J'+4) if product == (`J'+1) & d_g_brb == 1
.         replace product = (`J'+5) if product == (`J'+1) & d_g_whs == 1
.         replace product = (`J'+6) if product == (`J'+1) & d_g_teq == 1
.         replace product = (`J'+7) if product == (`J'+1) & d_g_otr == 1
.         replace product = (`J'+8) if product == (`J'+1) & d_g_rum == 1
. 
.         gen case = _n // Each "purchase" is a case. Now need to construct alternatives
.         egen brand_string = concat(brand_descr upc_descr size1_amount size1_units), punct(";") // used to ma
> tch to price schedules
.         egen mkt = group(date_m)
.         save prod_chars_individual, replace
. }

. 
. clear

. use prod_chars_individual

. /* outputing csv of product characteristics */
. preserve

.         drop if product == 0
(31095 observations deleted)

.         export delim using "product_chars.csv", replace
file product_chars.csv saved

. restore

. 
. /* Generating population & sample weights then sampling fewer of the outside
> option purchases. This should substantially reduce the number of observations
> in the data set. Note that weights apply to products not people. */
. 
. count
64611

. disp "Original case count: " r(N)
Original case count: 64611

. egen pop_weight = count(case), by(product)

. replace pop_weight = pop_weight / _N // converting to percents
(64611 real changes made)

. 
. // sampling non-liquor purchases
. /*
> count if product > `J'
> local liq_N = r(N)
> sample `liq_N' if product == 0, count // sampling as many outside option purchases as non-top 100 product pu
> rchases
> */
. egen sample_weight = count(case), by(product)

. replace sample_weight = sample_weight / _N // converting to percents
(64611 real changes made)

. 
. // end of sampling code
. end
unrecognized command:  end
r(199);

end of do-file

r(199);

. tab NYC

        NYC |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     48,105       74.45       74.45
          1 |     16,506       25.55      100.00
------------+-----------------------------------
      Total |     64,611      100.00

. tab region_code

region_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |     64,611      100.00      100.00
------------+-----------------------------------
      Total |     64,611      100.00

. tab scantrack_market_descr , missing

   scantrack_market_descr |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                   Albany |      7,184       11.12       11.12
      Buffalo - Rochester |     21,458       33.21       44.33
               Exurban NY |      1,240        1.92       46.25
               Rem Boston |        464        0.72       46.97
              Suburban NY |      9,882       15.29       62.26
                 Syracuse |      7,877       12.19       74.45
                 Urban NY |     16,506       25.55      100.00
--------------------------+-----------------------------------
                    Total |     64,611      100.00

. tab fips_state_code

fips_state_ |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
         36 |     64,611      100.00      100.00
------------+-----------------------------------
      Total |     64,611      100.00

. tab dma_descr , missing

                              dma_descr |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
             ALBANY-SCHENECTADY-TROY NY |      4,910        7.60        7.60
                          BINGHAMTON NY |      2,635        4.08       11.68
                             BUFFALO NY |     13,500       20.89       32.57
           BURLINGTON-PLATTSBURGH VT-NY |        464        0.72       33.29
                              ELMIRA NY |        897        1.39       34.68
                            NEW YORK NY |     29,902       46.28       80.96
                           ROCHESTER NY |      7,538       11.67       92.63
                          ROCHESTER, NY |          4        0.01       92.63
                               SYRACUSE |         42        0.07       92.70
                            SYRACUSE NY |      3,685        5.70       98.40
                               UTICA NY |        468        0.72       99.12
                           WATERTOWN NY |        566        0.88      100.00
----------------------------------------+-----------------------------------
                                  Total |     64,611      100.00

. tab fips_county_
fips_county_ ambiguous abbreviation
r(111);

. tab fips_county_descr

fips_county_ |
       descr |      Freq.     Percent        Cum.
-------------+-----------------------------------
      ALBANY |        986        1.53        1.53
    ALLEGANY |         54        0.08        1.61
       BRONX |      2,816        4.36        5.97
      BROOME |      2,008        3.11        9.08
 CATTARAUGUS |        245        0.38        9.46
      CAYUGA |        191        0.30        9.75
  CHAUTAUQUA |      1,116        1.73       11.48
     CHEMUNG |        418        0.65       12.12
    CHENANGO |        112        0.17       12.30
     CLINTON |        367        0.57       12.87
    COLUMBIA |        330        0.51       13.38
    CORTLAND |        376        0.58       13.96
    DELAWARE |        408        0.63       14.59
    DUTCHESS |      1,920        2.97       17.56
        ERIE |      9,617       14.88       32.45
       ESSEX |          8        0.01       32.46
    FRANKLIN |         89        0.14       32.60
      FULTON |         88        0.14       32.73
     GENESEE |        559        0.87       33.60
      GREENE |        277        0.43       34.03
    HAMILTON |         16        0.02       34.05
    HERKIMER |         84        0.13       34.18
   JEFFERSON |        341        0.53       34.71
       KINGS |      5,148        7.97       42.68
       LEWIS |         19        0.03       42.71
  LIVINGSTON |        455        0.70       43.41
     MADISON |        275        0.43       43.84
      MONROE |      5,398        8.35       52.19
  MONTGOMERY |         86        0.13       52.32
      NASSAU |      3,251        5.03       57.36
    NEW YORK |      3,487        5.40       62.75
     NIAGARA |      1,745        2.70       65.45
      ONEIDA |        328        0.51       65.96
    ONONDAGA |      1,626        2.52       68.48
     ONTARIO |      1,218        1.89       70.36
      ORANGE |        992        1.54       71.90
     ORLEANS |         50        0.08       71.98
      OSWEGO |        364        0.56       72.54
      OTSEGO |         98        0.15       72.69
      PUTNAM |        248        0.38       73.07
      QUEENS |      3,252        5.03       78.11
  RENSSELAER |        805        1.25       79.35
    RICHMOND |      1,803        2.79       82.14
    ROCKLAND |        671        1.04       83.18
    SARATOGA |        686        1.06       84.24
 SCHENECTADY |        649        1.00       85.25
   SCHOHARIE |        221        0.34       85.59
    SCHUYLER |         17        0.03       85.62
      SENECA |        154        0.24       85.86
 ST LAWRENCE |        206        0.32       86.17
     STEUBEN |        462        0.72       86.89
     SUFFOLK |      3,255        5.04       91.93
    SULLIVAN |         67        0.10       92.03
       TIOGA |        107        0.17       92.20
    TOMPKINS |        699        1.08       93.28
      ULSTER |        287        0.44       93.72
      WARREN |        533        0.82       94.55
  WASHINGTON |        233        0.36       94.91
       WAYNE |        421        0.65       95.56
 WESTCHESTER |      2,705        4.19       99.75
     WYOMING |        118        0.18       99.93
       YATES |         46        0.07      100.00
-------------+-----------------------------------
       Total |     64,611      100.00

. 
. 
. 
. 
. 
. 
. 
. tab scantrack_market_descr

   scantrack_market_descr |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                   Albany |      7,184       11.12       11.12
      Buffalo - Rochester |     21,458       33.21       44.33
               Exurban NY |      1,240        1.92       46.25
               Rem Boston |        464        0.72       46.97
              Suburban NY |      9,882       15.29       62.26
                 Syracuse |      7,877       12.19       74.45
                 Urban NY |     16,506       25.55      100.00
--------------------------+-----------------------------------
                    Total |     64,611      100.00

. tab scantrack_market_descr , missing

   scantrack_market_descr |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                   Albany |      7,184       11.12       11.12
      Buffalo - Rochester |     21,458       33.21       44.33
               Exurban NY |      1,240        1.92       46.25
               Rem Boston |        464        0.72       46.97
              Suburban NY |      9,882       15.29       62.26
                 Syracuse |      7,877       12.19       74.45
                 Urban NY |     16,506       25.55      100.00
--------------------------+-----------------------------------
                    Total |     64,611      100.00

. egen avg_price = mean(price), by(product date_m scantrack_market_code)

. do "C:\Users\garre\AppData\Local\Temp\STD0b000000.tmp"

. /* replacing imported, proof, and size dummies with avg value for aggregate products */
. foreach var of varlist d_s_* proof imported {
  2.         egen mean_`var' = mean(`var'), by(product)
  3.         replace `var' = mean_`var' if product > `J'
  4.         drop mean_`var'
  5. }
(31095 missing values generated)
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\garre\AppData\Local\Temp\STD0b000000.tmp"

. fillin product case // generate 1 product record per choice situation

. replace choice = 0 if choice == . // all new records are non-choices
(16669638 real changes made)

. 
. // setting product 0 attributes to 0
. foreach var of varlist d_*_* proof import price avg_price {
  2.         replace `var' = 0 if product == 0 
  3. }
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64611 real changes made)
(64600 real changes made)
(64611 real changes made)

. 
. // filling in case variables
. foreach var of varlist household_income white NYC date_m {
  2.         bys case (`var'): replace `var' = `var'[1] if missing(`var')
  3. }
(16669638 real changes made)
(16669638 real changes made)
(16669638 real changes made)
(16669638 real changes made)

. 
. 
. // filling in product variables except avg_price
. /* Uses means for conglomerate products and actual value for single products */
. foreach var of varlist d_g_* d_s_* proof imported {
  2.         bys product (`var'): replace `var' = `var'[1]
  3. }
(16636122 real changes made)
(16636122 real changes made)
(16636122 real changes made)
(16636122 real changes made)
(16636122 real changes made)
(16636122 real changes made)
(16636122 real changes made)
(16636122 real changes made)
(16637277 real changes made)
(16640214 real changes made)
(16639525 real changes made)
(16638509 real changes made)
(16646619 real changes made)
(16638174 real changes made)

. 
end of do-file

. preserve

. do "C:\Users\garre\AppData\Local\Temp\STD0b000000.tmp"

.         bys product date_m scantrack_market_code: keep if _n == 1
(16699462 observations deleted)

.         sort product date_m

.         xtset product date_m
repeated time values within panel
r(451);

end of do-file

r(451);

. egen mkt = group(date_m scantrack_market_code)
mkt already defined
r(110);

. drop mkt

. egen mkt = group(date_m scantrack_market_code)
(18907 missing values generated)

. list date_m scantrack_market_code if mkt == .

       +--------------------+
       |  date_m   scantr~e |
       |--------------------|
    7. | 2008m12          . |
   15. |  2009m1          . |
   23. |  2009m2          . |
   31. |  2009m3          . |
   38. |  2009m4          . |
       |--------------------|
   46. |  2009m5          . |
   54. |  2009m6          . |
   62. |  2009m7          . |
   70. |  2009m8          . |
   78. |  2009m9          . |
       |--------------------|
   86. | 2009m10          . |
   94. | 2009m11          . |
  102. | 2009m12          . |
  110. |  2010m1          . |
  118. |  2010m2          . |
       |--------------------|
  126. |  2010m3          . |
  134. |  2010m4          . |
  142. |  2010m5          . |
  150. |  2010m6          . |
  158. |  2010m7          . |
       |--------------------|
  166. |  2010m8          . |
  174. |  2010m9          . |
  182. | 2010m10          . |
  190. | 2010m11          . |
  198. | 2010m12          . |
       |--------------------|
  206. |  2011m1          . |
--Break--
r(1);

. tab scantrack_market_code scantrack_market_descr , missing

scantrack_ |
market_cod |                            scantrack_market_descr
         e |               Albany  Buffalo..  Exurban..  Rem Bos..  Suburba..   Syracuse |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |         0          0          0          0          0      2,175          0 |     2,175 
         9 |         0          0          0          0          0          0          0 |     3,197 
        10 |         0          0          0        518          0          0          0 |       518 
        32 |         0          0      4,960          0          0          0          0 |     4,960 
        43 |         0      2,406          0          0          0          0          0 |     2,406 
        52 |         0          0          0          0          0          0      2,407 |     2,407 
        55 |         0          0          0          0        217          0          0 |       217 
         . |    18,907          0          0          0          0          0          0 |    18,907 
-----------+-----------------------------------------------------------------------------+----------
     Total |    18,907      2,406      4,960        518        217      2,175      2,407 |    34,787 


           | scantrack_
scantrack_ | market_des
market_cod |     cr
         e |  Urban NY |     Total
-----------+-----------+----------
         8 |         0 |     2,175 
         9 |     3,197 |     3,197 
        10 |         0 |       518 
        32 |         0 |     4,960 
        43 |         0 |     2,406 
        52 |         0 |     2,407 
        55 |         0 |       217 
         . |         0 |    18,907 
-----------+-----------+----------
     Total |     3,197 |    34,787 


. browse if scantrack_market_code == .

. tab scantrack_market_code if _fillin == 1
no observations

. tab _fillin if scantrack_market_code == .

    _fillin |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,907      100.00      100.00
------------+-----------------------------------
      Total |     18,907      100.00

. restore

. preserve

. do "C:\Users\garre\AppData\Local\Temp\STD0b000000.tmp"

.         bys case (scantrack_market_code): replace scantrack_market_code = scantrack_market_code[1] if missin
> g(`var')
(0 real changes made)

.         drop mkt

.         egen mkt = group(date_m scantrack_market_code)
(16669638 missing values generated)

.         bys product mkt: keep if _n == 1
--Break--
r(1);

end of do-file

--Break--
r(1);

. restore

. preserve

. count if scantrack_market_code == .
16669638

. tab _fillin if scantrack_market_code == .

    _fillin |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 | 16,669,638      100.00      100.00
------------+-----------------------------------
      Total | 16,669,638      100.00

. sort case scantrack_market_code

. browse

. by case: replace scantrack_market_code == scantrack_market_code[1] if scantrack_market_code == .
== invalid name
r(198);

. by case: replace scantrack_market_code = scantrack_market_code[1] if missing(scantrack_market_code)
(16669638 real changes made)

. do "C:\Users\garre\AppData\Local\Temp\STD0b000000.tmp"

.         drop mkt

.         egen mkt = group(date_m scantrack_market_code)

.         bys product mkt: keep if _n == 1
(16602159 observations deleted)

.         sort product mkt

. 
end of do-file

. browse

. drop if product == 0
(510 observations deleted)

. browse if product == 1

. sort product date_m scantrack_market_code

. sort product scantrack_market_code date_m

. browse product avg_price

. browse product date_m scantrack_market_code avg_price

. egen test = count(avg_price), by(product)

. tab product test

           |                                     test
   product |         0          1          2          3          4          5          6 |     Total
-----------+-----------------------------------------------------------------------------+----------
         1 |         0          0          0        510          0          0          0 |       510 
         2 |         0          0          0        510          0          0          0 |       510 
         3 |         0          0          0          0          0          0        510 |       510 
         4 |         0          0        510          0          0          0          0 |       510 
         5 |         0          0          0        510          0          0          0 |       510 
         6 |         0          0        510          0          0          0          0 |       510 
         7 |         0          0          0          0          0        510          0 |       510 
         8 |         0          0          0        510          0          0          0 |       510 
         9 |         0          0        510          0          0          0          0 |       510 
        10 |       510          0          0          0          0          0          0 |       510 
        11 |         0          0          0          0          0          0        510 |       510 
        12 |         0          0        510          0          0          0          0 |       510 
        13 |         0          0          0          0        510          0          0 |       510 
        14 |         0          0          0        510          0          0          0 |       510 
        15 |         0        510          0          0          0          0          0 |       510 
        16 |       510          0          0          0          0          0          0 |       510 
        17 |         0        510          0          0          0          0          0 |       510 
        18 |         0        510          0          0          0          0          0 |       510 
        19 |         0          0        510          0          0          0          0 |       510 
        20 |         0          0        510          0          0          0          0 |       510 
        21 |         0          0        510          0          0          0          0 |       510 
        22 |         0          0        510          0          0          0          0 |       510 
        23 |         0          0        510          0          0          0          0 |       510 
        24 |         0          0        510          0          0          0          0 |       510 
        25 |         0          0          0          0          0          0          0 |       510 
        26 |         0        510          0          0          0          0          0 |       510 
        27 |       510          0          0          0          0          0          0 |       510 
        28 |         0          0        510          0          0          0          0 |       510 
        29 |         0          0        510          0          0          0          0 |       510 
        30 |         0          0        510          0          0          0          0 |       510 
        31 |       510          0          0          0          0          0          0 |       510 
        32 |         0          0          0        510          0          0          0 |       510 
        33 |         0        510          0          0          0          0          0 |       510 
        34 |       510          0          0          0          0          0          0 |       510 
        35 |       510          0          0          0          0          0          0 |       510 
        36 |       510          0          0          0          0          0          0 |       510 
        37 |         0          0          0        510          0          0          0 |       510 
        38 |         0        510          0          0          0          0          0 |       510 
        39 |         0          0        510          0          0          0          0 |       510 
        40 |         0        510          0          0          0          0          0 |       510 
        41 |       510          0          0          0          0          0          0 |       510 
        42 |       510          0          0          0          0          0          0 |       510 
        43 |       510          0          0          0          0          0          0 |       510 
        44 |         0          0          0          0          0          0          0 |       510 
        45 |         0        510          0          0          0          0          0 |       510 
        46 |       510          0          0          0          0          0          0 |       510 
        47 |       510          0          0          0          0          0          0 |       510 
        48 |         0          0        510          0          0          0          0 |       510 
        49 |         0        510          0          0          0          0          0 |       510 
        50 |       510          0          0          0          0          0          0 |       510 
        51 |       510          0          0          0          0          0          0 |       510 
        52 |       510          0          0          0          0          0          0 |       510 
        53 |       510          0          0          0          0          0          0 |       510 
        54 |         0        510          0          0          0          0          0 |       510 
        55 |         0          0          0          0        510          0          0 |       510 
        56 |         0        510          0          0          0          0          0 |       510 
        57 |         0          0          0        510          0          0          0 |       510 
        58 |       510          0          0          0          0          0          0 |       510 
        59 |       510          0          0          0          0          0          0 |       510 
        60 |       510          0          0          0          0          0          0 |       510 
        61 |       510          0          0          0          0          0          0 |       510 
        62 |         0          0        510          0          0          0          0 |       510 
        63 |         0        510          0          0          0          0          0 |       510 
        64 |       510          0          0          0          0          0          0 |       510 
        65 |       510          0          0          0          0          0          0 |       510 
        66 |         0        510          0          0          0          0          0 |       510 
        67 |         0        510          0          0          0          0          0 |       510 
        68 |       510          0          0          0          0          0          0 |       510 
        69 |       510          0          0          0          0          0          0 |       510 
        70 |         0        510          0          0          0          0          0 |       510 
        71 |         0        510          0          0          0          0          0 |       510 
        72 |       510          0          0          0          0          0          0 |       510 
        73 |         0          0        510          0          0          0          0 |       510 
        74 |       510          0          0          0          0          0          0 |       510 
        75 |         0          0        510          0          0          0          0 |       510 
        76 |       510          0          0          0          0          0          0 |       510 
        77 |       510          0          0          0          0          0          0 |       510 
        78 |       510          0          0          0          0          0          0 |       510 
        79 |       510          0          0          0          0          0          0 |       510 
        80 |         0        510          0          0          0          0          0 |       510 
        81 |       510          0          0          0          0          0          0 |       510 
        82 |         0        510          0          0          0          0          0 |       510 
        83 |         0        510          0          0          0          0          0 |       510 
        84 |         0        510          0          0          0          0          0 |       510 
        85 |         0          0        510          0          0          0          0 |       510 
        86 |         0          0        510          0          0          0          0 |       510 
        87 |       510          0          0          0          0          0          0 |       510 
        88 |       510          0          0          0          0          0          0 |       510 
        89 |       510          0          0          0          0          0          0 |       510 
        90 |       510          0          0          0          0          0          0 |       510 
        91 |         0        510          0          0          0          0          0 |       510 
        92 |       510          0          0          0          0          0          0 |       510 
        93 |       510          0          0          0          0          0          0 |       510 
        94 |       510          0          0          0          0          0          0 |       510 
        95 |       510          0          0          0          0          0          0 |       510 
        96 |       510          0          0          0          0          0          0 |       510 
        97 |       510          0          0          0          0          0          0 |       510 
        98 |         0        510          0          0          0          0          0 |       510 
        99 |       510          0          0          0          0          0          0 |       510 
       100 |       510          0          0          0          0          0          0 |       510 
       101 |         0        510          0          0          0          0          0 |       510 
       102 |       510          0          0          0          0          0          0 |       510 
       103 |       510          0          0          0          0          0          0 |       510 
       104 |         0        510          0          0          0          0          0 |       510 
       105 |         0        510          0          0          0          0          0 |       510 
       106 |         0        510          0          0          0          0          0 |       510 
       107 |       510          0          0          0          0          0          0 |       510 
       108 |       510          0          0          0          0          0          0 |       510 
       109 |         0        510          0          0          0          0          0 |       510 
       110 |         0        510          0          0          0          0          0 |       510 
       111 |         0          0        510          0          0          0          0 |       510 
       112 |       510          0          0          0          0          0          0 |       510 
       113 |         0        510          0          0          0          0          0 |       510 
       114 |       510          0          0          0          0          0          0 |       510 
       115 |       510          0          0          0          0          0          0 |       510 
       116 |         0        510          0          0          0          0          0 |       510 
       117 |       510          0          0          0          0          0          0 |       510 
       118 |         0        510          0          0          0          0          0 |       510 
       119 |       510          0          0          0          0          0          0 |       510 
       120 |       510          0          0          0          0          0          0 |       510 
       121 |         0        510          0          0          0          0          0 |       510 
       122 |         0        510          0          0          0          0          0 |       510 
       123 |         0        510          0          0          0          0          0 |       510 
       124 |       510          0          0          0          0          0          0 |       510 
       125 |       510          0          0          0          0          0          0 |       510 
       126 |       510          0          0          0          0          0          0 |       510 
       127 |       510          0          0          0          0          0          0 |       510 
       128 |       510          0          0          0          0          0          0 |       510 
       129 |       510          0          0          0          0          0          0 |       510 
       130 |       510          0          0          0          0          0          0 |       510 
       131 |       510          0          0          0          0          0          0 |       510 
       132 |       510          0          0          0          0          0          0 |       510 
       133 |       510          0          0          0          0          0          0 |       510 
       134 |         0        510          0          0          0          0          0 |       510 
       135 |       510          0          0          0          0          0          0 |       510 
       136 |         0        510          0          0          0          0          0 |       510 
       137 |       510          0          0          0          0          0          0 |       510 
       138 |       510          0          0          0          0          0          0 |       510 
       139 |       510          0          0          0          0          0          0 |       510 
       140 |       510          0          0          0          0          0          0 |       510 
       141 |         0        510          0          0          0          0          0 |       510 
       142 |       510          0          0          0          0          0          0 |       510 
       143 |       510          0          0          0          0          0          0 |       510 
       144 |       510          0          0          0          0          0          0 |       510 
       145 |       510          0          0          0          0          0          0 |       510 
       146 |       510          0          0          0          0          0          0 |       510 
       147 |       510          0          0          0          0          0          0 |       510 
       148 |       510          0          0          0          0          0          0 |       510 
       149 |       510          0          0          0          0          0          0 |       510 
       150 |         0        510          0          0          0          0          0 |       510 
       151 |         0          0        510          0          0          0          0 |       510 
       152 |       510          0          0          0          0          0          0 |       510 
       153 |       510          0          0          0          0          0          0 |       510 
       154 |       510          0          0          0          0          0          0 |       510 
       155 |       510          0          0          0          0          0          0 |       510 
       156 |       510          0          0          0          0          0          0 |       510 
       157 |       510          0          0          0          0          0          0 |       510 
       158 |       510          0          0          0          0          0          0 |       510 
       159 |         0        510          0          0          0          0          0 |       510 
       160 |         0        510          0          0          0          0          0 |       510 
       161 |       510          0          0          0          0          0          0 |       510 
       162 |       510          0          0          0          0          0          0 |       510 
       163 |       510          0          0          0          0          0          0 |       510 
       164 |       510          0          0          0          0          0          0 |       510 
       165 |       510          0          0          0          0          0          0 |       510 
       166 |       510          0          0          0          0          0          0 |       510 
       167 |       510          0          0          0          0          0          0 |       510 
       168 |         0        510          0          0          0          0          0 |       510 
       169 |         0        510          0          0          0          0          0 |       510 
       170 |       510          0          0          0          0          0          0 |       510 
       171 |       510          0          0          0          0          0          0 |       510 
       172 |         0        510          0          0          0          0          0 |       510 
       173 |       510          0          0          0          0          0          0 |       510 
       174 |       510          0          0          0          0          0          0 |       510 
       175 |       510          0          0          0          0          0          0 |       510 
       176 |       510          0          0          0          0          0          0 |       510 
       177 |       510          0          0          0          0          0          0 |       510 
       178 |       510          0          0          0          0          0          0 |       510 
       179 |       510          0          0          0          0          0          0 |       510 
       180 |       510          0          0          0          0          0          0 |       510 
       181 |         0        510          0          0          0          0          0 |       510 
       182 |       510          0          0          0          0          0          0 |       510 
       183 |       510          0          0          0          0          0          0 |       510 
       184 |       510          0          0          0          0          0          0 |       510 
       185 |       510          0          0          0          0          0          0 |       510 
       186 |       510          0          0          0          0          0          0 |       510 
       187 |       510          0          0          0          0          0          0 |       510 
       188 |       510          0          0          0          0          0          0 |       510 
       189 |         0        510          0          0          0          0          0 |       510 
       190 |       510          0          0          0          0          0          0 |       510 
       191 |         0        510          0          0          0          0          0 |       510 
       192 |       510          0          0          0          0          0          0 |       510 
       193 |         0        510          0          0          0          0          0 |       510 
       194 |       510          0          0          0          0          0          0 |       510 
       195 |       510          0          0          0          0          0          0 |       510 
       196 |       510          0          0          0          0          0          0 |       510 
       197 |         0        510          0          0          0          0          0 |       510 
       198 |       510          0          0          0          0          0          0 |       510 
       199 |       510          0          0          0          0          0          0 |       510 
       200 |         0        510          0          0          0          0          0 |       510 
       201 |       510          0          0          0          0          0          0 |       510 
       202 |       510          0          0          0          0          0          0 |       510 
       203 |       510          0          0          0          0          0          0 |       510 
       204 |       510          0          0          0          0          0          0 |       510 
       205 |       510          0          0          0          0          0          0 |       510 
       206 |       510          0          0          0          0          0          0 |       510 
       207 |       510          0          0          0          0          0          0 |       510 
       208 |       510          0          0          0          0          0          0 |       510 
       209 |       510          0          0          0          0          0          0 |       510 
       210 |       510          0          0          0          0          0          0 |       510 
       211 |         0        510          0          0          0          0          0 |       510 
       212 |       510          0          0          0          0          0          0 |       510 
       213 |         0        510          0          0          0          0          0 |       510 
       214 |       510          0          0          0          0          0          0 |       510 
       215 |       510          0          0          0          0          0          0 |       510 
       216 |         0        510          0          0          0          0          0 |       510 
       217 |       510          0          0          0          0          0          0 |       510 
       218 |       510          0          0          0          0          0          0 |       510 
       219 |       510          0          0          0          0          0          0 |       510 
       220 |       510          0          0          0          0          0          0 |       510 
       221 |         0        510          0          0          0          0          0 |       510 
       222 |       510          0          0          0          0          0          0 |       510 
       223 |       510          0          0          0          0          0          0 |       510 
       224 |       510          0          0          0          0          0          0 |       510 
       225 |       510          0          0          0          0          0          0 |       510 
       226 |       510          0          0          0          0          0          0 |       510 
       227 |       510          0          0          0          0          0          0 |       510 
       228 |       510          0          0          0          0          0          0 |       510 
       229 |         0        510          0          0          0          0          0 |       510 
       230 |         0        510          0          0          0          0          0 |       510 
       231 |       510          0          0          0          0          0          0 |       510 
       232 |       510          0          0          0          0          0          0 |       510 
       233 |       510          0          0          0          0          0          0 |       510 
       234 |         0        510          0          0          0          0          0 |       510 
       235 |       510          0          0          0          0          0          0 |       510 
       236 |         0        510          0          0          0          0          0 |       510 
       237 |         0        510          0          0          0          0          0 |       510 
       238 |       510          0          0          0          0          0          0 |       510 
       239 |       510          0          0          0          0          0          0 |       510 
       240 |       510          0          0          0          0          0          0 |       510 
       241 |       510          0          0          0          0          0          0 |       510 
       242 |       510          0          0          0          0          0          0 |       510 
       243 |       510          0          0          0          0          0          0 |       510 
       244 |         0        510          0          0          0          0          0 |       510 
       245 |       510          0          0          0          0          0          0 |       510 
       246 |       510          0          0          0          0          0          0 |       510 
       247 |       510          0          0          0          0          0          0 |       510 
       248 |         0        510          0          0          0          0          0 |       510 
       249 |       510          0          0          0          0          0          0 |       510 
       250 |       510          0          0          0          0          0          0 |       510 
       251 |         0          0          0          0          0          0        510 |       510 
       252 |         0          0          0          0          0          0          0 |       510 
       253 |         0          0          0          0          0        510          0 |       510 
       254 |         0          0          0          0          0          0          0 |       510 
       255 |         0          0        510          0          0          0          0 |       510 
       256 |         0          0          0        510          0          0          0 |       510 
       257 |         0          0          0          0          0          0          0 |       510 
       258 |         0          0          0          0          0          0        510 |       510 
-----------+-----------------------------------------------------------------------------+----------
     Total |    78,030     30,600     11,730      4,590      1,020      1,020      2,040 |   131,580 


           |               test
   product |         7         21         42 |     Total
-----------+---------------------------------+----------
         1 |         0          0          0 |       510 
         2 |         0          0          0 |       510 
         3 |         0          0          0 |       510 
         4 |         0          0          0 |       510 
         5 |         0          0          0 |       510 
         6 |         0          0          0 |       510 
         7 |         0          0          0 |       510 
         8 |         0          0          0 |       510 
         9 |         0          0          0 |       510 
        10 |         0          0          0 |       510 
        11 |         0          0          0 |       510 
        12 |         0          0          0 |       510 
        13 |         0          0          0 |       510 
        14 |         0          0          0 |       510 
        15 |         0          0          0 |       510 
        16 |         0          0          0 |       510 
        17 |         0          0          0 |       510 
        18 |         0          0          0 |       510 
        19 |         0          0          0 |       510 
        20 |         0          0          0 |       510 
        21 |         0          0          0 |       510 
        22 |         0          0          0 |       510 
        23 |         0          0          0 |       510 
        24 |         0          0          0 |       510 
        25 |       510          0          0 |       510 
        26 |         0          0          0 |       510 
        27 |         0          0          0 |       510 
        28 |         0          0          0 |       510 
        29 |         0          0          0 |       510 
        30 |         0          0          0 |       510 
        31 |         0          0          0 |       510 
        32 |         0          0          0 |       510 
        33 |         0          0          0 |       510 
        34 |         0          0          0 |       510 
        35 |         0          0          0 |       510 
        36 |         0          0          0 |       510 
        37 |         0          0          0 |       510 
        38 |         0          0          0 |       510 
        39 |         0          0          0 |       510 
        40 |         0          0          0 |       510 
        41 |         0          0          0 |       510 
        42 |         0          0          0 |       510 
        43 |         0          0          0 |       510 
        44 |       510          0          0 |       510 
        45 |         0          0          0 |       510 
        46 |         0          0          0 |       510 
        47 |         0          0          0 |       510 
        48 |         0          0          0 |       510 
        49 |         0          0          0 |       510 
        50 |         0          0          0 |       510 
        51 |         0          0          0 |       510 
        52 |         0          0          0 |       510 
        53 |         0          0          0 |       510 
        54 |         0          0          0 |       510 
        55 |         0          0          0 |       510 
        56 |         0          0          0 |       510 
        57 |         0          0          0 |       510 
        58 |         0          0          0 |       510 
        59 |         0          0          0 |       510 
        60 |         0          0          0 |       510 
        61 |         0          0          0 |       510 
        62 |         0          0          0 |       510 
        63 |         0          0          0 |       510 
        64 |         0          0          0 |       510 
        65 |         0          0          0 |       510 
        66 |         0          0          0 |       510 
        67 |         0          0          0 |       510 
        68 |         0          0          0 |       510 
        69 |         0          0          0 |       510 
        70 |         0          0          0 |       510 
        71 |         0          0          0 |       510 
        72 |         0          0          0 |       510 
        73 |         0          0          0 |       510 
        74 |         0          0          0 |       510 
        75 |         0          0          0 |       510 
        76 |         0          0          0 |       510 
        77 |         0          0          0 |       510 
        78 |         0          0          0 |       510 
        79 |         0          0          0 |       510 
        80 |         0          0          0 |       510 
        81 |         0          0          0 |       510 
        82 |         0          0          0 |       510 
        83 |         0          0          0 |       510 
        84 |         0          0          0 |       510 
        85 |         0          0          0 |       510 
        86 |         0          0          0 |       510 
        87 |         0          0          0 |       510 
        88 |         0          0          0 |       510 
        89 |         0          0          0 |       510 
        90 |         0          0          0 |       510 
        91 |         0          0          0 |       510 
        92 |         0          0          0 |       510 
        93 |         0          0          0 |       510 
        94 |         0          0          0 |       510 
        95 |         0          0          0 |       510 
        96 |         0          0          0 |       510 
        97 |         0          0          0 |       510 
        98 |         0          0          0 |       510 
        99 |         0          0          0 |       510 
       100 |         0          0          0 |       510 
       101 |         0          0          0 |       510 
       102 |         0          0          0 |       510 
       103 |         0          0          0 |       510 
       104 |         0          0          0 |       510 
       105 |         0          0          0 |       510 
       106 |         0          0          0 |       510 
       107 |         0          0          0 |       510 
       108 |         0          0          0 |       510 
       109 |         0          0          0 |       510 
       110 |         0          0          0 |       510 
       111 |         0          0          0 |       510 
       112 |         0          0          0 |       510 
       113 |         0          0          0 |       510 
       114 |         0          0          0 |       510 
       115 |         0          0          0 |       510 
       116 |         0          0          0 |       510 
       117 |         0          0          0 |       510 
       118 |         0          0          0 |       510 
       119 |         0          0          0 |       510 
       120 |         0          0          0 |       510 
       121 |         0          0          0 |       510 
       122 |         0          0          0 |       510 
       123 |         0          0          0 |       510 
       124 |         0          0          0 |       510 
       125 |         0          0          0 |       510 
       126 |         0          0          0 |       510 
       127 |         0          0          0 |       510 
       128 |         0          0          0 |       510 
       129 |         0          0          0 |       510 
       130 |         0          0          0 |       510 
       131 |         0          0          0 |       510 
       132 |         0          0          0 |       510 
       133 |         0          0          0 |       510 
       134 |         0          0          0 |       510 
       135 |         0          0          0 |       510 
       136 |         0          0          0 |       510 
       137 |         0          0          0 |       510 
       138 |         0          0          0 |       510 
       139 |         0          0          0 |       510 
       140 |         0          0          0 |       510 
       141 |         0          0          0 |       510 
       142 |         0          0          0 |       510 
       143 |         0          0          0 |       510 
       144 |         0          0          0 |       510 
       145 |         0          0          0 |       510 
       146 |         0          0          0 |       510 
       147 |         0          0          0 |       510 
       148 |         0          0          0 |       510 
       149 |         0          0          0 |       510 
       150 |         0          0          0 |       510 
       151 |         0          0          0 |       510 
       152 |         0          0          0 |       510 
       153 |         0          0          0 |       510 
       154 |         0          0          0 |       510 
       155 |         0          0          0 |       510 
       156 |         0          0          0 |       510 
       157 |         0          0          0 |       510 
       158 |         0          0          0 |       510 
       159 |         0          0          0 |       510 
       160 |         0          0          0 |       510 
       161 |         0          0          0 |       510 
       162 |         0          0          0 |       510 
       163 |         0          0          0 |       510 
       164 |         0          0          0 |       510 
       165 |         0          0          0 |       510 
       166 |         0          0          0 |       510 
       167 |         0          0          0 |       510 
       168 |         0          0          0 |       510 
       169 |         0          0          0 |       510 
       170 |         0          0          0 |       510 
       171 |         0          0          0 |       510 
       172 |         0          0          0 |       510 
       173 |         0          0          0 |       510 
       174 |         0          0          0 |       510 
       175 |         0          0          0 |       510 
       176 |         0          0          0 |       510 
       177 |         0          0          0 |       510 
       178 |         0          0          0 |       510 
       179 |         0          0          0 |       510 
       180 |         0          0          0 |       510 
       181 |         0          0          0 |       510 
       182 |         0          0          0 |       510 
       183 |         0          0          0 |       510 
       184 |         0          0          0 |       510 
       185 |         0          0          0 |       510 
       186 |         0          0          0 |       510 
       187 |         0          0          0 |       510 
       188 |         0          0          0 |       510 
       189 |         0          0          0 |       510 
       190 |         0          0          0 |       510 
       191 |         0          0          0 |       510 
       192 |         0          0          0 |       510 
       193 |         0          0          0 |       510 
       194 |         0          0          0 |       510 
       195 |         0          0          0 |       510 
       196 |         0          0          0 |       510 
       197 |         0          0          0 |       510 
       198 |         0          0          0 |       510 
       199 |         0          0          0 |       510 
       200 |         0          0          0 |       510 
       201 |         0          0          0 |       510 
       202 |         0          0          0 |       510 
       203 |         0          0          0 |       510 
       204 |         0          0          0 |       510 
       205 |         0          0          0 |       510 
       206 |         0          0          0 |       510 
       207 |         0          0          0 |       510 
       208 |         0          0          0 |       510 
       209 |         0          0          0 |       510 
       210 |         0          0          0 |       510 
       211 |         0          0          0 |       510 
       212 |         0          0          0 |       510 
       213 |         0          0          0 |       510 
       214 |         0          0          0 |       510 
       215 |         0          0          0 |       510 
       216 |         0          0          0 |       510 
       217 |         0          0          0 |       510 
       218 |         0          0          0 |       510 
       219 |         0          0          0 |       510 
       220 |         0          0          0 |       510 
       221 |         0          0          0 |       510 
       222 |         0          0          0 |       510 
       223 |         0          0          0 |       510 
       224 |         0          0          0 |       510 
       225 |         0          0          0 |       510 
       226 |         0          0          0 |       510 
       227 |         0          0          0 |       510 
       228 |         0          0          0 |       510 
       229 |         0          0          0 |       510 
       230 |         0          0          0 |       510 
       231 |         0          0          0 |       510 
       232 |         0          0          0 |       510 
       233 |         0          0          0 |       510 
       234 |         0          0          0 |       510 
       235 |         0          0          0 |       510 
       236 |         0          0          0 |       510 
       237 |         0          0          0 |       510 
       238 |         0          0          0 |       510 
       239 |         0          0          0 |       510 
       240 |         0          0          0 |       510 
       241 |         0          0          0 |       510 
       242 |         0          0          0 |       510 
       243 |         0          0          0 |       510 
       244 |         0          0          0 |       510 
       245 |         0          0          0 |       510 
       246 |         0          0          0 |       510 
       247 |         0          0          0 |       510 
       248 |         0          0          0 |       510 
       249 |         0          0          0 |       510 
       250 |         0          0          0 |       510 
       251 |         0          0          0 |       510 
       252 |         0        510          0 |       510 
       253 |         0          0          0 |       510 
       254 |       510          0          0 |       510 
       255 |         0          0          0 |       510 
       256 |         0          0          0 |       510 
       257 |         0          0        510 |       510 
       258 |         0          0          0 |       510 
-----------+---------------------------------+----------
     Total |     1,530        510        510 |   131,580 


. restore

. preserve

. tab product if choice == 1

    product |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,095       48.13       48.13
          1 |        844        1.31       49.43
          2 |        626        0.97       50.40
          3 |        578        0.89       51.30
          4 |        522        0.81       52.10
          5 |        508        0.79       52.89
          6 |        381        0.59       53.48
          7 |        372        0.58       54.06
          8 |        364        0.56       54.62
          9 |        331        0.51       55.13
         10 |        326        0.50       55.64
         11 |        324        0.50       56.14
         12 |        298        0.46       56.60
         13 |        290        0.45       57.05
         14 |        269        0.42       57.46
         15 |        258        0.40       57.86
         16 |        251        0.39       58.25
         17 |        247        0.38       58.63
         18 |        246        0.38       59.01
         19 |        234        0.36       59.38
         20 |        217        0.34       59.71
         21 |        212        0.33       60.04
         22 |        210        0.33       60.37
         23 |        206        0.32       60.68
         24 |        206        0.32       61.00
         25 |        205        0.32       61.32
         26 |        194        0.30       61.62
         27 |        193        0.30       61.92
         28 |        192        0.30       62.22
         29 |        182        0.28       62.50
         30 |        179        0.28       62.78
         31 |        179        0.28       63.05
--Break--
r(1);

. count if avg_price != . & product== 1
  844

. browse if avg_price != . & product== 1

. desc avg_price

              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------------------------------------------
avg_price       float   %9.0g                 

. tab household_code if product == 1 & choice == 1

household_c |
        ode |      Freq.     Percent        Cum.
------------+-----------------------------------
    2010136 |          2        0.24        0.24
    2019051 |         23        2.73        2.96
    2019387 |          1        0.12        3.08
    2037647 |          9        1.07        4.15
    2037651 |          1        0.12        4.27
    7825604 |          4        0.47        4.74
    8058861 |          2        0.24        4.98
    8060026 |          4        0.47        5.45
    8060147 |         46        5.45       10.90
    8060379 |          1        0.12       11.02
    8060517 |          2        0.24       11.26
    8060568 |         14        1.66       12.91
    8060632 |         18        2.13       15.05
    8060946 |          3        0.36       15.40
    8060979 |          6        0.71       16.11
    8061834 |         11        1.30       17.42
    8061846 |          1        0.12       17.54
    8063355 |          7        0.83       18.36
    8063457 |        348       41.23       59.60
    8066851 |          4        0.47       60.07
    8068909 |          1        0.12       60.19
    8072145 |          1        0.12       60.31
    8072148 |          1        0.12       60.43
    8073098 |          1        0.12       60.55
    8073442 |          2        0.24       60.78
    8076081 |          1        0.12       60.90
    8082765 |          1        0.12       61.02
    8095708 |          2        0.24       61.26
    8112243 |          1        0.12       61.37
    8115355 |          1        0.12       61.49
    8116141 |         21        2.49       63.98
    8119061 |          1        0.12       64.10
    8135116 |          1        0.12       64.22
    8150843 |          1        0.12       64.34
    8184307 |         52        6.16       70.50
    8256375 |          5        0.59       71.09
    8270275 |          1        0.12       71.21
    8271055 |          1        0.12       71.33
    8274479 |          2        0.24       71.56
    8276494 |          1        0.12       71.68
    8278393 |         10        1.18       72.87
    8304584 |         13        1.54       74.41
    8311842 |          1        0.12       74.53
    8322142 |          4        0.47       75.00
    8322260 |          8        0.95       75.95
    8322302 |          1        0.12       76.07
    8369286 |          5        0.59       76.66
    8372892 |          2        0.24       76.90
    8465163 |          7        0.83       77.73
    8495660 |          2        0.24       77.96
    8523638 |          1        0.12       78.08
    8647484 |          1        0.12       78.20
    8650707 |          1        0.12       78.32
    8756365 |          3        0.36       78.67
    8903885 |          2        0.24       78.91
    9153592 |          3        0.36       79.27
    9159687 |          1        0.12       79.38
    9159742 |          4        0.47       79.86
   3.00e+07 |          1        0.12       79.98
   3.00e+07 |          9        1.07       81.04
   3.00e+07 |          2        0.24       81.28
   3.00e+07 |          3        0.36       81.64
   3.01e+07 |          2        0.24       81.87
   3.01e+07 |         95       11.26       93.13
   3.01e+07 |          2        0.24       93.36
   3.02e+07 |         23        2.73       96.09
   3.02e+07 |          1        0.12       96.21
   3.02e+07 |          7        0.83       97.04
   3.03e+07 |          1        0.12       97.16
   3.03e+07 |          1        0.12       97.27
   3.04e+07 |          3        0.36       97.63
   3.04e+07 |          2        0.24       97.87
   3.04e+07 |         14        1.66       99.53
   3.04e+07 |          1        0.12       99.64
   3.07e+07 |          2        0.24       99.88
   3.07e+07 |          1        0.12      100.00
------------+-----------------------------------
      Total |        844      100.00

. gen date_no_fm = date_m

. browse if product == 1 & date_m == 643 & scantrack_market_code == 32

. drop mkt

. egen mkt = group(scantrack_market_code date_m)
(16669638 missing values generated)

. drop mkt

. do "C:\Users\garre\AppData\Local\Temp\STD0b000000.tmp"

.         bys case (scantrack_market_code): replace scantrack_market_code = scantrack_market_code[1] if missin
> g(scantrack_market_code)
(16669638 real changes made)

.         drop mkt
variable mkt not found
r(111);

end of do-file

r(111);

. egen mkt = group(scantrack_market_code date_m)

. bys product mkt (avg_price): keep if _n == 1
(16602159 observations deleted)

. count if avg_price != . & product == 1
  170

. count if avg_price != . & product == 2
  209

. browse if product == 1

. count if product == 1
  510

. tab scantrack_market_code

scantrack_m |
 arket_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          8 |     18,907       14.31       14.31
          9 |     18,907       14.31       28.63
         10 |     18,907       14.31       42.94
         32 |     18,907       14.31       57.25
         43 |     18,907       14.31       71.57
         52 |     18,907       14.31       85.88
         55 |     18,648       14.12      100.00
------------+-----------------------------------
      Total |    132,090      100.00

. disp 7*12*5
420

. disp 510/12
42.5

. tab year if product == 1

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2008 |          3        1.76        1.76
       2009 |         28       16.47       18.24
       2010 |         31       18.24       36.47
       2011 |         29       17.06       53.53
       2012 |         26       15.29       68.82
       2013 |         29       17.06       85.88
       2014 |         24       14.12      100.00
------------+-----------------------------------
      Total |        170      100.00

. disp 7*12*5 + 7
427

. tab scantrack_market_code if product == 1

scantrack_m |
 arket_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          8 |         73       14.31       14.31
          9 |         73       14.31       28.63
         10 |         73       14.31       42.94
         32 |         73       14.31       57.25
         43 |         73       14.31       71.57
         52 |         73       14.31       85.88
         55 |         72       14.12      100.00
------------+-----------------------------------
      Total |        510      100.00

. tab mkt

group(scant |
rack_market |
      _code |
    date_m) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        259        0.20        0.20
          2 |        259        0.20        0.39
          3 |        259        0.20        0.59
          4 |        259        0.20        0.78
          5 |        259        0.20        0.98
          6 |        259        0.20        1.18
          7 |        259        0.20        1.37
          8 |        259        0.20        1.57
          9 |        259        0.20        1.76
         10 |        259        0.20        1.96
         11 |        259        0.20        2.16
         12 |        259        0.20        2.35
         13 |        259        0.20        2.55
         14 |        259        0.20        2.75
         15 |        259        0.20        2.94
         16 |        259        0.20        3.14
         17 |        259        0.20        3.33
         18 |        259        0.20        3.53
         19 |        259        0.20        3.73
         20 |        259        0.20        3.92
         21 |        259        0.20        4.12
         22 |        259        0.20        4.31
         23 |        259        0.20        4.51
         24 |        259        0.20        4.71
         25 |        259        0.20        4.90
         26 |        259        0.20        5.10
         27 |        259        0.20        5.29
         28 |        259        0.20        5.49
         29 |        259        0.20        5.69
         30 |        259        0.20        5.88
         31 |        259        0.20        6.08
         32 |        259        0.20        6.27
         33 |        259        0.20        6.47
         34 |        259        0.20        6.67
         35 |        259        0.20        6.86
         36 |        259        0.20        7.06
         37 |        259        0.20        7.25
         38 |        259        0.20        7.45
         39 |        259        0.20        7.65
         40 |        259        0.20        7.84
         41 |        259        0.20        8.04
         42 |        259        0.20        8.24
         43 |        259        0.20        8.43
         44 |        259        0.20        8.63
         45 |        259        0.20        8.82
         46 |        259        0.20        9.02
         47 |        259        0.20        9.22
         48 |        259        0.20        9.41
         49 |        259        0.20        9.61
         50 |        259        0.20        9.80
         51 |        259        0.20       10.00
         52 |        259        0.20       10.20
         53 |        259        0.20       10.39
         54 |        259        0.20       10.59
         55 |        259        0.20       10.78
         56 |        259        0.20       10.98
         57 |        259        0.20       11.18
         58 |        259        0.20       11.37
         59 |        259        0.20       11.57
         60 |        259        0.20       11.76
         61 |        259        0.20       11.96
         62 |        259        0.20       12.16
         63 |        259        0.20       12.35
         64 |        259        0.20       12.55
         65 |        259        0.20       12.75
         66 |        259        0.20       12.94
         67 |        259        0.20       13.14
         68 |        259        0.20       13.33
         69 |        259        0.20       13.53
         70 |        259        0.20       13.73
         71 |        259        0.20       13.92
         72 |        259        0.20       14.12
         73 |        259        0.20       14.31
         74 |        259        0.20       14.51
         75 |        259        0.20       14.71
         76 |        259        0.20       14.90
         77 |        259        0.20       15.10
         78 |        259        0.20       15.29
         79 |        259        0.20       15.49
         80 |        259        0.20       15.69
         81 |        259        0.20       15.88
         82 |        259        0.20       16.08
         83 |        259        0.20       16.27
         84 |        259        0.20       16.47
         85 |        259        0.20       16.67
         86 |        259        0.20       16.86
         87 |        259        0.20       17.06
         88 |        259        0.20       17.25
         89 |        259        0.20       17.45
         90 |        259        0.20       17.65
         91 |        259        0.20       17.84
         92 |        259        0.20       18.04
         93 |        259        0.20       18.24
         94 |        259        0.20       18.43
         95 |        259        0.20       18.63
         96 |        259        0.20       18.82
         97 |        259        0.20       19.02
         98 |        259        0.20       19.22
         99 |        259        0.20       19.41
        100 |        259        0.20       19.61
        101 |        259        0.20       19.80
        102 |        259        0.20       20.00
        103 |        259        0.20       20.20
        104 |        259        0.20       20.39
        105 |        259        0.20       20.59
        106 |        259        0.20       20.78
        107 |        259        0.20       20.98
        108 |        259        0.20       21.18
        109 |        259        0.20       21.37
        110 |        259        0.20       21.57
        111 |        259        0.20       21.76
        112 |        259        0.20       21.96
        113 |        259        0.20       22.16
        114 |        259        0.20       22.35
        115 |        259        0.20       22.55
        116 |        259        0.20       22.75
        117 |        259        0.20       22.94
        118 |        259        0.20       23.14
        119 |        259        0.20       23.33
        120 |        259        0.20       23.53
        121 |        259        0.20       23.73
        122 |        259        0.20       23.92
        123 |        259        0.20       24.12
        124 |        259        0.20       24.31
        125 |        259        0.20       24.51
        126 |        259        0.20       24.71
        127 |        259        0.20       24.90
        128 |        259        0.20       25.10
        129 |        259        0.20       25.29
        130 |        259        0.20       25.49
        131 |        259        0.20       25.69
        132 |        259        0.20       25.88
        133 |        259        0.20       26.08
        134 |        259        0.20       26.27
        135 |        259        0.20       26.47
        136 |        259        0.20       26.67
        137 |        259        0.20       26.86
        138 |        259        0.20       27.06
        139 |        259        0.20       27.25
        140 |        259        0.20       27.45
        141 |        259        0.20       27.65
        142 |        259        0.20       27.84
        143 |        259        0.20       28.04
        144 |        259        0.20       28.24
        145 |        259        0.20       28.43
        146 |        259        0.20       28.63
        147 |        259        0.20       28.82
        148 |        259        0.20       29.02
        149 |        259        0.20       29.22
        150 |        259        0.20       29.41
        151 |        259        0.20       29.61
        152 |        259        0.20       29.80
        153 |        259        0.20       30.00
        154 |        259        0.20       30.20
        155 |        259        0.20       30.39
        156 |        259        0.20       30.59
        157 |        259        0.20       30.78
        158 |        259        0.20       30.98
        159 |        259        0.20       31.18
        160 |        259        0.20       31.37
        161 |        259        0.20       31.57
        162 |        259        0.20       31.76
        163 |        259        0.20       31.96
        164 |        259        0.20       32.16
        165 |        259        0.20       32.35
        166 |        259        0.20       32.55
        167 |        259        0.20       32.75
        168 |        259        0.20       32.94
        169 |        259        0.20       33.14
        170 |        259        0.20       33.33
        171 |        259        0.20       33.53
        172 |        259        0.20       33.73
        173 |        259        0.20       33.92
        174 |        259        0.20       34.12
        175 |        259        0.20       34.31
        176 |        259        0.20       34.51
        177 |        259        0.20       34.71
        178 |        259        0.20       34.90
        179 |        259        0.20       35.10
        180 |        259        0.20       35.29
        181 |        259        0.20       35.49
        182 |        259        0.20       35.69
        183 |        259        0.20       35.88
        184 |        259        0.20       36.08
        185 |        259        0.20       36.27
        186 |        259        0.20       36.47
        187 |        259        0.20       36.67
        188 |        259        0.20       36.86
        189 |        259        0.20       37.06
        190 |        259        0.20       37.25
        191 |        259        0.20       37.45
        192 |        259        0.20       37.65
        193 |        259        0.20       37.84
        194 |        259        0.20       38.04
        195 |        259        0.20       38.24
        196 |        259        0.20       38.43
        197 |        259        0.20       38.63
        198 |        259        0.20       38.82
        199 |        259        0.20       39.02
        200 |        259        0.20       39.22
        201 |        259        0.20       39.41
        202 |        259        0.20       39.61
        203 |        259        0.20       39.80
        204 |        259        0.20       40.00
        205 |        259        0.20       40.20
        206 |        259        0.20       40.39
        207 |        259        0.20       40.59
        208 |        259        0.20       40.78
        209 |        259        0.20       40.98
        210 |        259        0.20       41.18
        211 |        259        0.20       41.37
        212 |        259        0.20       41.57
        213 |        259        0.20       41.76
        214 |        259        0.20       41.96
        215 |        259        0.20       42.16
        216 |        259        0.20       42.35
        217 |        259        0.20       42.55
        218 |        259        0.20       42.75
        219 |        259        0.20       42.94
        220 |        259        0.20       43.14
        221 |        259        0.20       43.33
        222 |        259        0.20       43.53
        223 |        259        0.20       43.73
        224 |        259        0.20       43.92
        225 |        259        0.20       44.12
        226 |        259        0.20       44.31
        227 |        259        0.20       44.51
        228 |        259        0.20       44.71
        229 |        259        0.20       44.90
        230 |        259        0.20       45.10
        231 |        259        0.20       45.29
        232 |        259        0.20       45.49
        233 |        259        0.20       45.69
        234 |        259        0.20       45.88
        235 |        259        0.20       46.08
        236 |        259        0.20       46.27
        237 |        259        0.20       46.47
        238 |        259        0.20       46.67
        239 |        259        0.20       46.86
        240 |        259        0.20       47.06
        241 |        259        0.20       47.25
        242 |        259        0.20       47.45
        243 |        259        0.20       47.65
        244 |        259        0.20       47.84
        245 |        259        0.20       48.04
        246 |        259        0.20       48.24
        247 |        259        0.20       48.43
        248 |        259        0.20       48.63
        249 |        259        0.20       48.82
        250 |        259        0.20       49.02
        251 |        259        0.20       49.22
        252 |        259        0.20       49.41
        253 |        259        0.20       49.61
        254 |        259        0.20       49.80
        255 |        259        0.20       50.00
        256 |        259        0.20       50.20
        257 |        259        0.20       50.39
        258 |        259        0.20       50.59
        259 |        259        0.20       50.78
        260 |        259        0.20       50.98
        261 |        259        0.20       51.18
        262 |        259        0.20       51.37
        263 |        259        0.20       51.57
        264 |        259        0.20       51.76
        265 |        259        0.20       51.96
        266 |        259        0.20       52.16
        267 |        259        0.20       52.35
        268 |        259        0.20       52.55
        269 |        259        0.20       52.75
        270 |        259        0.20       52.94
        271 |        259        0.20       53.14
        272 |        259        0.20       53.33
        273 |        259        0.20       53.53
        274 |        259        0.20       53.73
        275 |        259        0.20       53.92
        276 |        259        0.20       54.12
        277 |        259        0.20       54.31
        278 |        259        0.20       54.51
        279 |        259        0.20       54.71
        280 |        259        0.20       54.90
        281 |        259        0.20       55.10
        282 |        259        0.20       55.29
        283 |        259        0.20       55.49
        284 |        259        0.20       55.69
        285 |        259        0.20       55.88
        286 |        259        0.20       56.08
        287 |        259        0.20       56.27
        288 |        259        0.20       56.47
        289 |        259        0.20       56.67
        290 |        259        0.20       56.86
        291 |        259        0.20       57.06
        292 |        259        0.20       57.25
        293 |        259        0.20       57.45
        294 |        259        0.20       57.65
        295 |        259        0.20       57.84
        296 |        259        0.20       58.04
        297 |        259        0.20       58.24
        298 |        259        0.20       58.43
        299 |        259        0.20       58.63
        300 |        259        0.20       58.82
        301 |        259        0.20       59.02
        302 |        259        0.20       59.22
        303 |        259        0.20       59.41
        304 |        259        0.20       59.61
        305 |        259        0.20       59.80
        306 |        259        0.20       60.00
        307 |        259        0.20       60.20
        308 |        259        0.20       60.39
        309 |        259        0.20       60.59
        310 |        259        0.20       60.78
        311 |        259        0.20       60.98
        312 |        259        0.20       61.18
        313 |        259        0.20       61.37
        314 |        259        0.20       61.57
        315 |        259        0.20       61.76
        316 |        259        0.20       61.96
        317 |        259        0.20       62.16
        318 |        259        0.20       62.35
        319 |        259        0.20       62.55
        320 |        259        0.20       62.75
        321 |        259        0.20       62.94
        322 |        259        0.20       63.14
        323 |        259        0.20       63.33
        324 |        259        0.20       63.53
        325 |        259        0.20       63.73
        326 |        259        0.20       63.92
        327 |        259        0.20       64.12
        328 |        259        0.20       64.31
        329 |        259        0.20       64.51
        330 |        259        0.20       64.71
        331 |        259        0.20       64.90
        332 |        259        0.20       65.10
        333 |        259        0.20       65.29
        334 |        259        0.20       65.49
        335 |        259        0.20       65.69
        336 |        259        0.20       65.88
        337 |        259        0.20       66.08
        338 |        259        0.20       66.27
        339 |        259        0.20       66.47
        340 |        259        0.20       66.67
        341 |        259        0.20       66.86
        342 |        259        0.20       67.06
        343 |        259        0.20       67.25
        344 |        259        0.20       67.45
        345 |        259        0.20       67.65
        346 |        259        0.20       67.84
        347 |        259        0.20       68.04
        348 |        259        0.20       68.24
        349 |        259        0.20       68.43
        350 |        259        0.20       68.63
        351 |        259        0.20       68.82
        352 |        259        0.20       69.02
        353 |        259        0.20       69.22
        354 |        259        0.20       69.41
        355 |        259        0.20       69.61
        356 |        259        0.20       69.80
        357 |        259        0.20       70.00
        358 |        259        0.20       70.20
        359 |        259        0.20       70.39
        360 |        259        0.20       70.59
        361 |        259        0.20       70.78
        362 |        259        0.20       70.98
        363 |        259        0.20       71.18
        364 |        259        0.20       71.37
        365 |        259        0.20       71.57
        366 |        259        0.20       71.76
        367 |        259        0.20       71.96
        368 |        259        0.20       72.16
        369 |        259        0.20       72.35
        370 |        259        0.20       72.55
        371 |        259        0.20       72.75
        372 |        259        0.20       72.94
        373 |        259        0.20       73.14
        374 |        259        0.20       73.33
        375 |        259        0.20       73.53
        376 |        259        0.20       73.73
        377 |        259        0.20       73.92
        378 |        259        0.20       74.12
        379 |        259        0.20       74.31
        380 |        259        0.20       74.51
        381 |        259        0.20       74.71
        382 |        259        0.20       74.90
        383 |        259        0.20       75.10
        384 |        259        0.20       75.29
        385 |        259        0.20       75.49
        386 |        259        0.20       75.69
        387 |        259        0.20       75.88
        388 |        259        0.20       76.08
        389 |        259        0.20       76.27
        390 |        259        0.20       76.47
        391 |        259        0.20       76.67
        392 |        259        0.20       76.86
        393 |        259        0.20       77.06
        394 |        259        0.20       77.25
        395 |        259        0.20       77.45
        396 |        259        0.20       77.65
        397 |        259        0.20       77.84
        398 |        259        0.20       78.04
        399 |        259        0.20       78.24
        400 |        259        0.20       78.43
        401 |        259        0.20       78.63
        402 |        259        0.20       78.82
        403 |        259        0.20       79.02
        404 |        259        0.20       79.22
        405 |        259        0.20       79.41
        406 |        259        0.20       79.61
        407 |        259        0.20       79.80
        408 |        259        0.20       80.00
        409 |        259        0.20       80.20
        410 |        259        0.20       80.39
        411 |        259        0.20       80.59
        412 |        259        0.20       80.78
        413 |        259        0.20       80.98
        414 |        259        0.20       81.18
        415 |        259        0.20       81.37
        416 |        259        0.20       81.57
        417 |        259        0.20       81.76
        418 |        259        0.20       81.96
        419 |        259        0.20       82.16
        420 |        259        0.20       82.35
        421 |        259        0.20       82.55
        422 |        259        0.20       82.75
        423 |        259        0.20       82.94
        424 |        259        0.20       83.14
        425 |        259        0.20       83.33
        426 |        259        0.20       83.53
        427 |        259        0.20       83.73
        428 |        259        0.20       83.92
        429 |        259        0.20       84.12
        430 |        259        0.20       84.31
        431 |        259        0.20       84.51
        432 |        259        0.20       84.71
        433 |        259        0.20       84.90
        434 |        259        0.20       85.10
        435 |        259        0.20       85.29
        436 |        259        0.20       85.49
        437 |        259        0.20       85.69
        438 |        259        0.20       85.88
        439 |        259        0.20       86.08
        440 |        259        0.20       86.27
        441 |        259        0.20       86.47
        442 |        259        0.20       86.67
        443 |        259        0.20       86.86
        444 |        259        0.20       87.06
        445 |        259        0.20       87.25
        446 |        259        0.20       87.45
        447 |        259        0.20       87.65
        448 |        259        0.20       87.84
        449 |        259        0.20       88.04
        450 |        259        0.20       88.24
        451 |        259        0.20       88.43
        452 |        259        0.20       88.63
        453 |        259        0.20       88.82
        454 |        259        0.20       89.02
        455 |        259        0.20       89.22
        456 |        259        0.20       89.41
        457 |        259        0.20       89.61
        458 |        259        0.20       89.80
        459 |        259        0.20       90.00
        460 |        259        0.20       90.20
        461 |        259        0.20       90.39
        462 |        259        0.20       90.59
        463 |        259        0.20       90.78
        464 |        259        0.20       90.98
        465 |        259        0.20       91.18
        466 |        259        0.20       91.37
        467 |        259        0.20       91.57
        468 |        259        0.20       91.76
        469 |        259        0.20       91.96
        470 |        259        0.20       92.16
        471 |        259        0.20       92.35
        472 |        259        0.20       92.55
        473 |        259        0.20       92.75
        474 |        259        0.20       92.94
        475 |        259        0.20       93.14
        476 |        259        0.20       93.33
        477 |        259        0.20       93.53
        478 |        259        0.20       93.73
        479 |        259        0.20       93.92
        480 |        259        0.20       94.12
        481 |        259        0.20       94.31
        482 |        259        0.20       94.51
        483 |        259        0.20       94.71
        484 |        259        0.20       94.90
        485 |        259        0.20       95.10
        486 |        259        0.20       95.29
        487 |        259        0.20       95.49
        488 |        259        0.20       95.69
        489 |        259        0.20       95.88
        490 |        259        0.20       96.08
        491 |        259        0.20       96.27
        492 |        259        0.20       96.47
        493 |        259        0.20       96.67
        494 |        259        0.20       96.86
        495 |        259        0.20       97.06
        496 |        259        0.20       97.25
        497 |        259        0.20       97.45
        498 |        259        0.20       97.65
        499 |        259        0.20       97.84
        500 |        259        0.20       98.04
        501 |        259        0.20       98.24
        502 |        259        0.20       98.43
        503 |        259        0.20       98.63
        504 |        259        0.20       98.82
        505 |        259        0.20       99.02
        506 |        259        0.20       99.22
        507 |        259        0.20       99.41
        508 |        259        0.20       99.61
        509 |        259        0.20       99.80
        510 |        259        0.20      100.00
------------+-----------------------------------
      Total |    132,090      100.00

. drop if year == 2008
(100 observations deleted)

. tab mkt

group(scant |
rack_market |
      _code |
    date_m) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        235        0.18        0.18
          2 |        259        0.20        0.37
          3 |        259        0.20        0.57
          4 |        259        0.20        0.77
          5 |        259        0.20        0.96
          6 |        259        0.20        1.16
          7 |        259        0.20        1.36
          8 |        259        0.20        1.55
          9 |        259        0.20        1.75
         10 |        259        0.20        1.94
         11 |        259        0.20        2.14
         12 |        259        0.20        2.34
         13 |        259        0.20        2.53
         14 |        259        0.20        2.73
         15 |        259        0.20        2.93
         16 |        259        0.20        3.12
         17 |        259        0.20        3.32
         18 |        259        0.20        3.51
         19 |        259        0.20        3.71
         20 |        259        0.20        3.91
         21 |        259        0.20        4.10
         22 |        259        0.20        4.30
         23 |        259        0.20        4.50
         24 |        259        0.20        4.69
         25 |        259        0.20        4.89
         26 |        259        0.20        5.08
         27 |        259        0.20        5.28
         28 |        259        0.20        5.48
         29 |        259        0.20        5.67
         30 |        259        0.20        5.87
         31 |        259        0.20        6.06
         32 |        259        0.20        6.26
         33 |        259        0.20        6.46
         34 |        259        0.20        6.65
         35 |        259        0.20        6.85
         36 |        259        0.20        7.05
         37 |        259        0.20        7.24
         38 |        259        0.20        7.44
         39 |        259        0.20        7.63
         40 |        259        0.20        7.83
         41 |        259        0.20        8.03
         42 |        259        0.20        8.22
         43 |        259        0.20        8.42
         44 |        259        0.20        8.62
         45 |        259        0.20        8.81
         46 |        259        0.20        9.01
         47 |        259        0.20        9.20
         48 |        259        0.20        9.40
         49 |        259        0.20        9.60
         50 |        259        0.20        9.79
         51 |        259        0.20        9.99
         52 |        259        0.20       10.19
         53 |        259        0.20       10.38
         54 |        259        0.20       10.58
         55 |        259        0.20       10.77
         56 |        259        0.20       10.97
         57 |        259        0.20       11.17
         58 |        259        0.20       11.36
         59 |        259        0.20       11.56
         60 |        259        0.20       11.76
         61 |        259        0.20       11.95
         62 |        259        0.20       12.15
         63 |        259        0.20       12.34
         64 |        259        0.20       12.54
         65 |        259        0.20       12.74
         66 |        259        0.20       12.93
         67 |        259        0.20       13.13
         68 |        259        0.20       13.33
         69 |        259        0.20       13.52
         70 |        259        0.20       13.72
         71 |        259        0.20       13.91
         72 |        259        0.20       14.11
         73 |        259        0.20       14.31
         74 |        243        0.18       14.49
         75 |        259        0.20       14.69
         76 |        259        0.20       14.88
         77 |        259        0.20       15.08
         78 |        259        0.20       15.28
         79 |        259        0.20       15.47
         80 |        259        0.20       15.67
         81 |        259        0.20       15.86
         82 |        259        0.20       16.06
         83 |        259        0.20       16.26
         84 |        259        0.20       16.45
         85 |        259        0.20       16.65
         86 |        259        0.20       16.85
         87 |        259        0.20       17.04
         88 |        259        0.20       17.24
         89 |        259        0.20       17.43
         90 |        259        0.20       17.63
         91 |        259        0.20       17.83
         92 |        259        0.20       18.02
         93 |        259        0.20       18.22
         94 |        259        0.20       18.42
         95 |        259        0.20       18.61
         96 |        259        0.20       18.81
         97 |        259        0.20       19.00
         98 |        259        0.20       19.20
         99 |        259        0.20       19.40
        100 |        259        0.20       19.59
        101 |        259        0.20       19.79
        102 |        259        0.20       19.98
        103 |        259        0.20       20.18
        104 |        259        0.20       20.38
        105 |        259        0.20       20.57
        106 |        259        0.20       20.77
        107 |        259        0.20       20.97
        108 |        259        0.20       21.16
        109 |        259        0.20       21.36
        110 |        259        0.20       21.55
        111 |        259        0.20       21.75
        112 |        259        0.20       21.95
        113 |        259        0.20       22.14
        114 |        259        0.20       22.34
        115 |        259        0.20       22.54
        116 |        259        0.20       22.73
        117 |        259        0.20       22.93
        118 |        259        0.20       23.12
        119 |        259        0.20       23.32
        120 |        259        0.20       23.52
        121 |        259        0.20       23.71
        122 |        259        0.20       23.91
        123 |        259        0.20       24.11
        124 |        259        0.20       24.30
        125 |        259        0.20       24.50
        126 |        259        0.20       24.69
        127 |        259        0.20       24.89
        128 |        259        0.20       25.09
        129 |        259        0.20       25.28
        130 |        259        0.20       25.48
        131 |        259        0.20       25.68
        132 |        259        0.20       25.87
        133 |        259        0.20       26.07
        134 |        259        0.20       26.26
        135 |        259        0.20       26.46
        136 |        259        0.20       26.66
        137 |        259        0.20       26.85
        138 |        259        0.20       27.05
        139 |        259        0.20       27.25
        140 |        259        0.20       27.44
        141 |        259        0.20       27.64
        142 |        259        0.20       27.83
        143 |        259        0.20       28.03
        144 |        259        0.20       28.23
        145 |        259        0.20       28.42
        146 |        259        0.20       28.62
        147 |        258        0.20       28.81
        148 |        259        0.20       29.01
        149 |        259        0.20       29.21
        150 |        259        0.20       29.40
        151 |        259        0.20       29.60
        152 |        259        0.20       29.80
        153 |        259        0.20       29.99
        154 |        259        0.20       30.19
        155 |        259        0.20       30.38
        156 |        259        0.20       30.58
        157 |        259        0.20       30.78
        158 |        259        0.20       30.97
        159 |        259        0.20       31.17
        160 |        259        0.20       31.37
        161 |        259        0.20       31.56
        162 |        259        0.20       31.76
        163 |        259        0.20       31.95
        164 |        259        0.20       32.15
        165 |        259        0.20       32.35
        166 |        259        0.20       32.54
        167 |        259        0.20       32.74
        168 |        259        0.20       32.94
        169 |        259        0.20       33.13
        170 |        259        0.20       33.33
        171 |        259        0.20       33.52
        172 |        259        0.20       33.72
        173 |        259        0.20       33.92
        174 |        259        0.20       34.11
        175 |        259        0.20       34.31
        176 |        259        0.20       34.50
        177 |        259        0.20       34.70
        178 |        259        0.20       34.90
        179 |        259        0.20       35.09
        180 |        259        0.20       35.29
        181 |        259        0.20       35.49
        182 |        259        0.20       35.68
        183 |        259        0.20       35.88
        184 |        259        0.20       36.07
        185 |        259        0.20       36.27
        186 |        259        0.20       36.47
        187 |        259        0.20       36.66
        188 |        259        0.20       36.86
        189 |        259        0.20       37.06
        190 |        259        0.20       37.25
        191 |        259        0.20       37.45
        192 |        259        0.20       37.64
        193 |        259        0.20       37.84
        194 |        259        0.20       38.04
        195 |        259        0.20       38.23
        196 |        259        0.20       38.43
        197 |        259        0.20       38.63
        198 |        259        0.20       38.82
        199 |        259        0.20       39.02
        200 |        259        0.20       39.21
        201 |        259        0.20       39.41
        202 |        259        0.20       39.61
        203 |        259        0.20       39.80
        204 |        259        0.20       40.00
        205 |        259        0.20       40.20
        206 |        259        0.20       40.39
        207 |        259        0.20       40.59
        208 |        259        0.20       40.78
        209 |        259        0.20       40.98
        210 |        259        0.20       41.18
        211 |        259        0.20       41.37
        212 |        259        0.20       41.57
        213 |        259        0.20       41.77
        214 |        259        0.20       41.96
        215 |        259        0.20       42.16
        216 |        259        0.20       42.35
        217 |        259        0.20       42.55
        218 |        259        0.20       42.75
        219 |        259        0.20       42.94
        220 |        230        0.17       43.12
        221 |        259        0.20       43.31
        222 |        259        0.20       43.51
        223 |        259        0.20       43.71
        224 |        259        0.20       43.90
        225 |        259        0.20       44.10
        226 |        259        0.20       44.29
        227 |        259        0.20       44.49
        228 |        259        0.20       44.69
        229 |        259        0.20       44.88
        230 |        259        0.20       45.08
        231 |        259        0.20       45.28
        232 |        259        0.20       45.47
        233 |        259        0.20       45.67
        234 |        259        0.20       45.86
        235 |        259        0.20       46.06
        236 |        259        0.20       46.26
        237 |        259        0.20       46.45
        238 |        259        0.20       46.65
        239 |        259        0.20       46.85
        240 |        259        0.20       47.04
        241 |        259        0.20       47.24
        242 |        259        0.20       47.43
        243 |        259        0.20       47.63
        244 |        259        0.20       47.83
        245 |        259        0.20       48.02
        246 |        259        0.20       48.22
        247 |        259        0.20       48.42
        248 |        259        0.20       48.61
        249 |        259        0.20       48.81
        250 |        259        0.20       49.00
        251 |        259        0.20       49.20
        252 |        259        0.20       49.40
        253 |        259        0.20       49.59
        254 |        259        0.20       49.79
        255 |        259        0.20       49.98
        256 |        259        0.20       50.18
        257 |        259        0.20       50.38
        258 |        259        0.20       50.57
        259 |        259        0.20       50.77
        260 |        259        0.20       50.97
        261 |        259        0.20       51.16
        262 |        259        0.20       51.36
        263 |        259        0.20       51.55
        264 |        259        0.20       51.75
        265 |        259        0.20       51.95
        266 |        259        0.20       52.14
        267 |        259        0.20       52.34
        268 |        259        0.20       52.54
        269 |        259        0.20       52.73
        270 |        259        0.20       52.93
        271 |        259        0.20       53.12
        272 |        259        0.20       53.32
        273 |        259        0.20       53.52
        274 |        259        0.20       53.71
        275 |        259        0.20       53.91
        276 |        259        0.20       54.11
        277 |        259        0.20       54.30
        278 |        259        0.20       54.50
        279 |        259        0.20       54.69
        280 |        259        0.20       54.89
        281 |        259        0.20       55.09
        282 |        259        0.20       55.28
        283 |        259        0.20       55.48
        284 |        259        0.20       55.68
        285 |        259        0.20       55.87
        286 |        259        0.20       56.07
        287 |        259        0.20       56.26
        288 |        259        0.20       56.46
        289 |        259        0.20       56.66
        290 |        259        0.20       56.85
        291 |        259        0.20       57.05
        292 |        259        0.20       57.25
        293 |        248        0.19       57.43
        294 |        259        0.20       57.63
        295 |        259        0.20       57.83
        296 |        259        0.20       58.02
        297 |        259        0.20       58.22
        298 |        259        0.20       58.41
        299 |        259        0.20       58.61
        300 |        259        0.20       58.81
        301 |        259        0.20       59.00
        302 |        259        0.20       59.20
        303 |        259        0.20       59.40
        304 |        259        0.20       59.59
        305 |        259        0.20       59.79
        306 |        259        0.20       59.98
        307 |        259        0.20       60.18
        308 |        259        0.20       60.38
        309 |        259        0.20       60.57
        310 |        259        0.20       60.77
        311 |        259        0.20       60.97
        312 |        259        0.20       61.16
        313 |        259        0.20       61.36
        314 |        259        0.20       61.55
        315 |        259        0.20       61.75
        316 |        259        0.20       61.95
        317 |        259        0.20       62.14
        318 |        259        0.20       62.34
        319 |        259        0.20       62.54
        320 |        259        0.20       62.73
        321 |        259        0.20       62.93
        322 |        259        0.20       63.12
        323 |        259        0.20       63.32
        324 |        259        0.20       63.52
        325 |        259        0.20       63.71
        326 |        259        0.20       63.91
        327 |        259        0.20       64.10
        328 |        259        0.20       64.30
        329 |        259        0.20       64.50
        330 |        259        0.20       64.69
        331 |        259        0.20       64.89
        332 |        259        0.20       65.09
        333 |        259        0.20       65.28
        334 |        259        0.20       65.48
        335 |        259        0.20       65.67
        336 |        259        0.20       65.87
        337 |        259        0.20       66.07
        338 |        259        0.20       66.26
        339 |        259        0.20       66.46
        340 |        259        0.20       66.66
        341 |        259        0.20       66.85
        342 |        259        0.20       67.05
        343 |        259        0.20       67.24
        344 |        259        0.20       67.44
        345 |        259        0.20       67.64
        346 |        259        0.20       67.83
        347 |        259        0.20       68.03
        348 |        259        0.20       68.23
        349 |        259        0.20       68.42
        350 |        259        0.20       68.62
        351 |        259        0.20       68.81
        352 |        259        0.20       69.01
        353 |        259        0.20       69.21
        354 |        259        0.20       69.40
        355 |        259        0.20       69.60
        356 |        259        0.20       69.80
        357 |        259        0.20       69.99
        358 |        259        0.20       70.19
        359 |        259        0.20       70.38
        360 |        259        0.20       70.58
        361 |        259        0.20       70.78
        362 |        259        0.20       70.97
        363 |        259        0.20       71.17
        364 |        259        0.20       71.37
        365 |        259        0.20       71.56
        366 |        242        0.18       71.74
        367 |        259        0.20       71.94
        368 |        259        0.20       72.14
        369 |        259        0.20       72.33
        370 |        259        0.20       72.53
        371 |        259        0.20       72.73
        372 |        259        0.20       72.92
        373 |        259        0.20       73.12
        374 |        259        0.20       73.31
        375 |        259        0.20       73.51
        376 |        259        0.20       73.71
        377 |        259        0.20       73.90
        378 |        259        0.20       74.10
        379 |        259        0.20       74.30
        380 |        259        0.20       74.49
        381 |        259        0.20       74.69
        382 |        259        0.20       74.88
        383 |        259        0.20       75.08
        384 |        259        0.20       75.28
        385 |        259        0.20       75.47
        386 |        259        0.20       75.67
        387 |        259        0.20       75.87
        388 |        259        0.20       76.06
        389 |        259        0.20       76.26
        390 |        259        0.20       76.45
        391 |        259        0.20       76.65
        392 |        259        0.20       76.85
        393 |        259        0.20       77.04
        394 |        259        0.20       77.24
        395 |        259        0.20       77.44
        396 |        259        0.20       77.63
        397 |        259        0.20       77.83
        398 |        259        0.20       78.02
        399 |        259        0.20       78.22
        400 |        259        0.20       78.42
        401 |        259        0.20       78.61
        402 |        259        0.20       78.81
        403 |        259        0.20       79.01
        404 |        259        0.20       79.20
        405 |        259        0.20       79.40
        406 |        259        0.20       79.59
        407 |        259        0.20       79.79
        408 |        259        0.20       79.99
        409 |        259        0.20       80.18
        410 |        259        0.20       80.38
        411 |        259        0.20       80.58
        412 |        259        0.20       80.77
        413 |        259        0.20       80.97
        414 |        259        0.20       81.16
        415 |        259        0.20       81.36
        416 |        259        0.20       81.56
        417 |        259        0.20       81.75
        418 |        259        0.20       81.95
        419 |        259        0.20       82.14
        420 |        259        0.20       82.34
        421 |        259        0.20       82.54
        422 |        259        0.20       82.73
        423 |        259        0.20       82.93
        424 |        259        0.20       83.13
        425 |        259        0.20       83.32
        426 |        259        0.20       83.52
        427 |        259        0.20       83.71
        428 |        259        0.20       83.91
        429 |        259        0.20       84.11
        430 |        259        0.20       84.30
        431 |        259        0.20       84.50
        432 |        259        0.20       84.70
        433 |        259        0.20       84.89
        434 |        259        0.20       85.09
        435 |        259        0.20       85.28
        436 |        259        0.20       85.48
        437 |        259        0.20       85.68
        438 |        259        0.20       85.87
        439 |        257        0.19       86.07
        440 |        259        0.20       86.26
        441 |        259        0.20       86.46
        442 |        259        0.20       86.66
        443 |        259        0.20       86.85
        444 |        259        0.20       87.05
        445 |        259        0.20       87.25
        446 |        259        0.20       87.44
        447 |        259        0.20       87.64
        448 |        259        0.20       87.83
        449 |        259        0.20       88.03
        450 |        259        0.20       88.23
        451 |        259        0.20       88.42
        452 |        259        0.20       88.62
        453 |        259        0.20       88.82
        454 |        259        0.20       89.01
        455 |        259        0.20       89.21
        456 |        259        0.20       89.40
        457 |        259        0.20       89.60
        458 |        259        0.20       89.80
        459 |        259        0.20       89.99
        460 |        259        0.20       90.19
        461 |        259        0.20       90.38
        462 |        259        0.20       90.58
        463 |        259        0.20       90.78
        464 |        259        0.20       90.97
        465 |        259        0.20       91.17
        466 |        259        0.20       91.37
        467 |        259        0.20       91.56
        468 |        259        0.20       91.76
        469 |        259        0.20       91.95
        470 |        259        0.20       92.15
        471 |        259        0.20       92.35
        472 |        259        0.20       92.54
        473 |        259        0.20       92.74
        474 |        259        0.20       92.94
        475 |        259        0.20       93.13
        476 |        259        0.20       93.33
        477 |        259        0.20       93.52
        478 |        259        0.20       93.72
        479 |        259        0.20       93.92
        480 |        259        0.20       94.11
        481 |        259        0.20       94.31
        482 |        259        0.20       94.51
        483 |        259        0.20       94.70
        484 |        259        0.20       94.90
        485 |        259        0.20       95.09
        486 |        259        0.20       95.29
        487 |        259        0.20       95.49
        488 |        259        0.20       95.68
        489 |        259        0.20       95.88
        490 |        259        0.20       96.08
        491 |        259        0.20       96.27
        492 |        259        0.20       96.47
        493 |        259        0.20       96.66
        494 |        259        0.20       96.86
        495 |        259        0.20       97.06
        496 |        259        0.20       97.25
        497 |        259        0.20       97.45
        498 |        259        0.20       97.65
        499 |        259        0.20       97.84
        500 |        259        0.20       98.04
        501 |        259        0.20       98.23
        502 |        259        0.20       98.43
        503 |        259        0.20       98.63
        504 |        259        0.20       98.82
        505 |        259        0.20       99.02
        506 |        259        0.20       99.22
        507 |        259        0.20       99.41
        508 |        259        0.20       99.61
        509 |        259        0.20       99.80
        510 |        259        0.20      100.00
------------+-----------------------------------
      Total |    131,990      100.00

. disp 12*6*7
504

. egen test = group(scantrack_market_code date_m)

. tab test

group(scant |
rack_market |
      _code |
    date_m) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        235        0.18        0.18
          2 |        259        0.20        0.37
          3 |        259        0.20        0.57
          4 |        259        0.20        0.77
          5 |        259        0.20        0.96
          6 |        259        0.20        1.16
          7 |        259        0.20        1.36
          8 |        259        0.20        1.55
          9 |        259        0.20        1.75
         10 |        259        0.20        1.94
         11 |        259        0.20        2.14
         12 |        259        0.20        2.34
         13 |        259        0.20        2.53
         14 |        259        0.20        2.73
         15 |        259        0.20        2.93
         16 |        259        0.20        3.12
         17 |        259        0.20        3.32
         18 |        259        0.20        3.51
         19 |        259        0.20        3.71
         20 |        259        0.20        3.91
         21 |        259        0.20        4.10
         22 |        259        0.20        4.30
         23 |        259        0.20        4.50
         24 |        259        0.20        4.69
         25 |        259        0.20        4.89
         26 |        259        0.20        5.08
         27 |        259        0.20        5.28
         28 |        259        0.20        5.48
         29 |        259        0.20        5.67
         30 |        259        0.20        5.87
         31 |        259        0.20        6.06
         32 |        259        0.20        6.26
         33 |        259        0.20        6.46
         34 |        259        0.20        6.65
         35 |        259        0.20        6.85
         36 |        259        0.20        7.05
         37 |        259        0.20        7.24
         38 |        259        0.20        7.44
         39 |        259        0.20        7.63
         40 |        259        0.20        7.83
         41 |        259        0.20        8.03
         42 |        259        0.20        8.22
         43 |        259        0.20        8.42
         44 |        259        0.20        8.62
         45 |        259        0.20        8.81
         46 |        259        0.20        9.01
         47 |        259        0.20        9.20
         48 |        259        0.20        9.40
         49 |        259        0.20        9.60
         50 |        259        0.20        9.79
         51 |        259        0.20        9.99
         52 |        259        0.20       10.19
         53 |        259        0.20       10.38
         54 |        259        0.20       10.58
         55 |        259        0.20       10.77
         56 |        259        0.20       10.97
         57 |        259        0.20       11.17
         58 |        259        0.20       11.36
         59 |        259        0.20       11.56
         60 |        259        0.20       11.76
         61 |        259        0.20       11.95
         62 |        259        0.20       12.15
         63 |        259        0.20       12.34
         64 |        259        0.20       12.54
         65 |        259        0.20       12.74
         66 |        259        0.20       12.93
         67 |        259        0.20       13.13
         68 |        259        0.20       13.33
         69 |        259        0.20       13.52
         70 |        259        0.20       13.72
         71 |        259        0.20       13.91
         72 |        259        0.20       14.11
         73 |        259        0.20       14.31
         74 |        243        0.18       14.49
         75 |        259        0.20       14.69
         76 |        259        0.20       14.88
         77 |        259        0.20       15.08
         78 |        259        0.20       15.28
         79 |        259        0.20       15.47
         80 |        259        0.20       15.67
         81 |        259        0.20       15.86
         82 |        259        0.20       16.06
         83 |        259        0.20       16.26
         84 |        259        0.20       16.45
         85 |        259        0.20       16.65
         86 |        259        0.20       16.85
         87 |        259        0.20       17.04
         88 |        259        0.20       17.24
         89 |        259        0.20       17.43
         90 |        259        0.20       17.63
         91 |        259        0.20       17.83
         92 |        259        0.20       18.02
         93 |        259        0.20       18.22
         94 |        259        0.20       18.42
         95 |        259        0.20       18.61
         96 |        259        0.20       18.81
         97 |        259        0.20       19.00
         98 |        259        0.20       19.20
         99 |        259        0.20       19.40
        100 |        259        0.20       19.59
        101 |        259        0.20       19.79
        102 |        259        0.20       19.98
        103 |        259        0.20       20.18
        104 |        259        0.20       20.38
        105 |        259        0.20       20.57
        106 |        259        0.20       20.77
        107 |        259        0.20       20.97
        108 |        259        0.20       21.16
        109 |        259        0.20       21.36
        110 |        259        0.20       21.55
        111 |        259        0.20       21.75
        112 |        259        0.20       21.95
        113 |        259        0.20       22.14
        114 |        259        0.20       22.34
        115 |        259        0.20       22.54
        116 |        259        0.20       22.73
        117 |        259        0.20       22.93
        118 |        259        0.20       23.12
        119 |        259        0.20       23.32
        120 |        259        0.20       23.52
        121 |        259        0.20       23.71
        122 |        259        0.20       23.91
        123 |        259        0.20       24.11
        124 |        259        0.20       24.30
        125 |        259        0.20       24.50
        126 |        259        0.20       24.69
        127 |        259        0.20       24.89
        128 |        259        0.20       25.09
        129 |        259        0.20       25.28
        130 |        259        0.20       25.48
        131 |        259        0.20       25.68
        132 |        259        0.20       25.87
        133 |        259        0.20       26.07
        134 |        259        0.20       26.26
        135 |        259        0.20       26.46
        136 |        259        0.20       26.66
        137 |        259        0.20       26.85
        138 |        259        0.20       27.05
        139 |        259        0.20       27.25
        140 |        259        0.20       27.44
        141 |        259        0.20       27.64
        142 |        259        0.20       27.83
        143 |        259        0.20       28.03
        144 |        259        0.20       28.23
        145 |        259        0.20       28.42
        146 |        259        0.20       28.62
        147 |        258        0.20       28.81
        148 |        259        0.20       29.01
        149 |        259        0.20       29.21
        150 |        259        0.20       29.40
        151 |        259        0.20       29.60
        152 |        259        0.20       29.80
        153 |        259        0.20       29.99
        154 |        259        0.20       30.19
        155 |        259        0.20       30.38
        156 |        259        0.20       30.58
        157 |        259        0.20       30.78
        158 |        259        0.20       30.97
        159 |        259        0.20       31.17
        160 |        259        0.20       31.37
        161 |        259        0.20       31.56
        162 |        259        0.20       31.76
        163 |        259        0.20       31.95
        164 |        259        0.20       32.15
        165 |        259        0.20       32.35
        166 |        259        0.20       32.54
        167 |        259        0.20       32.74
        168 |        259        0.20       32.94
        169 |        259        0.20       33.13
        170 |        259        0.20       33.33
        171 |        259        0.20       33.52
        172 |        259        0.20       33.72
        173 |        259        0.20       33.92
        174 |        259        0.20       34.11
        175 |        259        0.20       34.31
        176 |        259        0.20       34.50
        177 |        259        0.20       34.70
        178 |        259        0.20       34.90
        179 |        259        0.20       35.09
        180 |        259        0.20       35.29
        181 |        259        0.20       35.49
        182 |        259        0.20       35.68
        183 |        259        0.20       35.88
        184 |        259        0.20       36.07
        185 |        259        0.20       36.27
        186 |        259        0.20       36.47
        187 |        259        0.20       36.66
        188 |        259        0.20       36.86
        189 |        259        0.20       37.06
        190 |        259        0.20       37.25
        191 |        259        0.20       37.45
        192 |        259        0.20       37.64
        193 |        259        0.20       37.84
        194 |        259        0.20       38.04
        195 |        259        0.20       38.23
        196 |        259        0.20       38.43
        197 |        259        0.20       38.63
        198 |        259        0.20       38.82
        199 |        259        0.20       39.02
        200 |        259        0.20       39.21
        201 |        259        0.20       39.41
        202 |        259        0.20       39.61
        203 |        259        0.20       39.80
        204 |        259        0.20       40.00
        205 |        259        0.20       40.20
        206 |        259        0.20       40.39
        207 |        259        0.20       40.59
        208 |        259        0.20       40.78
        209 |        259        0.20       40.98
        210 |        259        0.20       41.18
        211 |        259        0.20       41.37
        212 |        259        0.20       41.57
        213 |        259        0.20       41.77
        214 |        259        0.20       41.96
        215 |        259        0.20       42.16
        216 |        259        0.20       42.35
        217 |        259        0.20       42.55
        218 |        259        0.20       42.75
        219 |        259        0.20       42.94
        220 |        230        0.17       43.12
        221 |        259        0.20       43.31
        222 |        259        0.20       43.51
        223 |        259        0.20       43.71
        224 |        259        0.20       43.90
        225 |        259        0.20       44.10
        226 |        259        0.20       44.29
        227 |        259        0.20       44.49
        228 |        259        0.20       44.69
        229 |        259        0.20       44.88
        230 |        259        0.20       45.08
        231 |        259        0.20       45.28
        232 |        259        0.20       45.47
        233 |        259        0.20       45.67
        234 |        259        0.20       45.86
        235 |        259        0.20       46.06
        236 |        259        0.20       46.26
        237 |        259        0.20       46.45
        238 |        259        0.20       46.65
        239 |        259        0.20       46.85
        240 |        259        0.20       47.04
        241 |        259        0.20       47.24
        242 |        259        0.20       47.43
        243 |        259        0.20       47.63
        244 |        259        0.20       47.83
        245 |        259        0.20       48.02
        246 |        259        0.20       48.22
        247 |        259        0.20       48.42
        248 |        259        0.20       48.61
        249 |        259        0.20       48.81
        250 |        259        0.20       49.00
        251 |        259        0.20       49.20
        252 |        259        0.20       49.40
        253 |        259        0.20       49.59
        254 |        259        0.20       49.79
        255 |        259        0.20       49.98
        256 |        259        0.20       50.18
        257 |        259        0.20       50.38
        258 |        259        0.20       50.57
        259 |        259        0.20       50.77
        260 |        259        0.20       50.97
        261 |        259        0.20       51.16
        262 |        259        0.20       51.36
        263 |        259        0.20       51.55
        264 |        259        0.20       51.75
        265 |        259        0.20       51.95
        266 |        259        0.20       52.14
        267 |        259        0.20       52.34
        268 |        259        0.20       52.54
        269 |        259        0.20       52.73
        270 |        259        0.20       52.93
        271 |        259        0.20       53.12
        272 |        259        0.20       53.32
        273 |        259        0.20       53.52
        274 |        259        0.20       53.71
        275 |        259        0.20       53.91
        276 |        259        0.20       54.11
        277 |        259        0.20       54.30
        278 |        259        0.20       54.50
        279 |        259        0.20       54.69
        280 |        259        0.20       54.89
        281 |        259        0.20       55.09
        282 |        259        0.20       55.28
        283 |        259        0.20       55.48
        284 |        259        0.20       55.68
        285 |        259        0.20       55.87
        286 |        259        0.20       56.07
        287 |        259        0.20       56.26
        288 |        259        0.20       56.46
        289 |        259        0.20       56.66
        290 |        259        0.20       56.85
        291 |        259        0.20       57.05
        292 |        259        0.20       57.25
        293 |        248        0.19       57.43
        294 |        259        0.20       57.63
        295 |        259        0.20       57.83
        296 |        259        0.20       58.02
        297 |        259        0.20       58.22
        298 |        259        0.20       58.41
        299 |        259        0.20       58.61
        300 |        259        0.20       58.81
        301 |        259        0.20       59.00
        302 |        259        0.20       59.20
        303 |        259        0.20       59.40
        304 |        259        0.20       59.59
        305 |        259        0.20       59.79
        306 |        259        0.20       59.98
        307 |        259        0.20       60.18
        308 |        259        0.20       60.38
        309 |        259        0.20       60.57
        310 |        259        0.20       60.77
        311 |        259        0.20       60.97
        312 |        259        0.20       61.16
        313 |        259        0.20       61.36
        314 |        259        0.20       61.55
        315 |        259        0.20       61.75
        316 |        259        0.20       61.95
        317 |        259        0.20       62.14
        318 |        259        0.20       62.34
        319 |        259        0.20       62.54
        320 |        259        0.20       62.73
        321 |        259        0.20       62.93
        322 |        259        0.20       63.12
        323 |        259        0.20       63.32
        324 |        259        0.20       63.52
        325 |        259        0.20       63.71
        326 |        259        0.20       63.91
        327 |        259        0.20       64.10
        328 |        259        0.20       64.30
        329 |        259        0.20       64.50
        330 |        259        0.20       64.69
        331 |        259        0.20       64.89
        332 |        259        0.20       65.09
        333 |        259        0.20       65.28
        334 |        259        0.20       65.48
        335 |        259        0.20       65.67
        336 |        259        0.20       65.87
        337 |        259        0.20       66.07
        338 |        259        0.20       66.26
        339 |        259        0.20       66.46
        340 |        259        0.20       66.66
        341 |        259        0.20       66.85
        342 |        259        0.20       67.05
        343 |        259        0.20       67.24
        344 |        259        0.20       67.44
        345 |        259        0.20       67.64
        346 |        259        0.20       67.83
        347 |        259        0.20       68.03
        348 |        259        0.20       68.23
        349 |        259        0.20       68.42
        350 |        259        0.20       68.62
        351 |        259        0.20       68.81
        352 |        259        0.20       69.01
        353 |        259        0.20       69.21
        354 |        259        0.20       69.40
        355 |        259        0.20       69.60
        356 |        259        0.20       69.80
        357 |        259        0.20       69.99
        358 |        259        0.20       70.19
        359 |        259        0.20       70.38
        360 |        259        0.20       70.58
        361 |        259        0.20       70.78
        362 |        259        0.20       70.97
        363 |        259        0.20       71.17
        364 |        259        0.20       71.37
        365 |        259        0.20       71.56
        366 |        242        0.18       71.74
        367 |        259        0.20       71.94
        368 |        259        0.20       72.14
        369 |        259        0.20       72.33
        370 |        259        0.20       72.53
        371 |        259        0.20       72.73
        372 |        259        0.20       72.92
        373 |        259        0.20       73.12
        374 |        259        0.20       73.31
        375 |        259        0.20       73.51
        376 |        259        0.20       73.71
        377 |        259        0.20       73.90
        378 |        259        0.20       74.10
        379 |        259        0.20       74.30
        380 |        259        0.20       74.49
        381 |        259        0.20       74.69
        382 |        259        0.20       74.88
        383 |        259        0.20       75.08
        384 |        259        0.20       75.28
        385 |        259        0.20       75.47
        386 |        259        0.20       75.67
        387 |        259        0.20       75.87
        388 |        259        0.20       76.06
        389 |        259        0.20       76.26
        390 |        259        0.20       76.45
        391 |        259        0.20       76.65
        392 |        259        0.20       76.85
        393 |        259        0.20       77.04
        394 |        259        0.20       77.24
        395 |        259        0.20       77.44
        396 |        259        0.20       77.63
        397 |        259        0.20       77.83
        398 |        259        0.20       78.02
        399 |        259        0.20       78.22
        400 |        259        0.20       78.42
        401 |        259        0.20       78.61
        402 |        259        0.20       78.81
        403 |        259        0.20       79.01
        404 |        259        0.20       79.20
        405 |        259        0.20       79.40
        406 |        259        0.20       79.59
        407 |        259        0.20       79.79
        408 |        259        0.20       79.99
        409 |        259        0.20       80.18
        410 |        259        0.20       80.38
        411 |        259        0.20       80.58
        412 |        259        0.20       80.77
        413 |        259        0.20       80.97
        414 |        259        0.20       81.16
        415 |        259        0.20       81.36
        416 |        259        0.20       81.56
        417 |        259        0.20       81.75
        418 |        259        0.20       81.95
        419 |        259        0.20       82.14
        420 |        259        0.20       82.34
        421 |        259        0.20       82.54
        422 |        259        0.20       82.73
        423 |        259        0.20       82.93
        424 |        259        0.20       83.13
        425 |        259        0.20       83.32
        426 |        259        0.20       83.52
        427 |        259        0.20       83.71
        428 |        259        0.20       83.91
        429 |        259        0.20       84.11
        430 |        259        0.20       84.30
        431 |        259        0.20       84.50
        432 |        259        0.20       84.70
        433 |        259        0.20       84.89
        434 |        259        0.20       85.09
        435 |        259        0.20       85.28
        436 |        259        0.20       85.48
        437 |        259        0.20       85.68
        438 |        259        0.20       85.87
        439 |        257        0.19       86.07
        440 |        259        0.20       86.26
        441 |        259        0.20       86.46
        442 |        259        0.20       86.66
        443 |        259        0.20       86.85
        444 |        259        0.20       87.05
        445 |        259        0.20       87.25
        446 |        259        0.20       87.44
        447 |        259        0.20       87.64
        448 |        259        0.20       87.83
        449 |        259        0.20       88.03
        450 |        259        0.20       88.23
        451 |        259        0.20       88.42
        452 |        259        0.20       88.62
        453 |        259        0.20       88.82
        454 |        259        0.20       89.01
        455 |        259        0.20       89.21
        456 |        259        0.20       89.40
        457 |        259        0.20       89.60
        458 |        259        0.20       89.80
        459 |        259        0.20       89.99
        460 |        259        0.20       90.19
        461 |        259        0.20       90.38
        462 |        259        0.20       90.58
        463 |        259        0.20       90.78
        464 |        259        0.20       90.97
        465 |        259        0.20       91.17
        466 |        259        0.20       91.37
        467 |        259        0.20       91.56
        468 |        259        0.20       91.76
        469 |        259        0.20       91.95
        470 |        259        0.20       92.15
        471 |        259        0.20       92.35
        472 |        259        0.20       92.54
        473 |        259        0.20       92.74
        474 |        259        0.20       92.94
        475 |        259        0.20       93.13
        476 |        259        0.20       93.33
        477 |        259        0.20       93.52
        478 |        259        0.20       93.72
        479 |        259        0.20       93.92
        480 |        259        0.20       94.11
        481 |        259        0.20       94.31
        482 |        259        0.20       94.51
        483 |        259        0.20       94.70
        484 |        259        0.20       94.90
        485 |        259        0.20       95.09
        486 |        259        0.20       95.29
        487 |        259        0.20       95.49
        488 |        259        0.20       95.68
        489 |        259        0.20       95.88
        490 |        259        0.20       96.08
        491 |        259        0.20       96.27
        492 |        259        0.20       96.47
        493 |        259        0.20       96.66
        494 |        259        0.20       96.86
        495 |        259        0.20       97.06
        496 |        259        0.20       97.25
        497 |        259        0.20       97.45
        498 |        259        0.20       97.65
        499 |        259        0.20       97.84
        500 |        259        0.20       98.04
        501 |        259        0.20       98.23
        502 |        259        0.20       98.43
        503 |        259        0.20       98.63
        504 |        259        0.20       98.82
        505 |        259        0.20       99.02
        506 |        259        0.20       99.22
        507 |        259        0.20       99.41
        508 |        259        0.20       99.61
        509 |        259        0.20       99.80
        510 |        259        0.20      100.00
------------+-----------------------------------
      Total |    131,990      100.00

. tab scantrack_market_code

scantrack_m |
 arket_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          8 |     18,883       14.31       14.31
          9 |     18,891       14.31       28.62
         10 |     18,906       14.32       42.94
         32 |     18,878       14.30       57.25
         43 |     18,896       14.32       71.56
         52 |     18,890       14.31       85.87
         55 |     18,646       14.13      100.00
------------+-----------------------------------
      Total |    131,990      100.00

. disp 510/7
72.857143

. tab date_m

     date_m |      Freq.     Percent        Cum.
------------+-----------------------------------
    2008m12 |      1,713        1.30        1.30
     2009m1 |      1,813        1.37        2.67
     2009m2 |      1,813        1.37        4.05
     2009m3 |      1,813        1.37        5.42
     2009m4 |      1,813        1.37        6.79
     2009m5 |      1,813        1.37        8.17
     2009m6 |      1,813        1.37        9.54
     2009m7 |      1,813        1.37       10.91
     2009m8 |      1,813        1.37       12.29
     2009m9 |      1,813        1.37       13.66
    2009m10 |      1,813        1.37       15.03
    2009m11 |      1,813        1.37       16.41
    2009m12 |      1,813        1.37       17.78
     2010m1 |      1,813        1.37       19.15
     2010m2 |      1,813        1.37       20.53
     2010m3 |      1,813        1.37       21.90
     2010m4 |      1,813        1.37       23.28
     2010m5 |      1,813        1.37       24.65
     2010m6 |      1,813        1.37       26.02
     2010m7 |      1,813        1.37       27.40
     2010m8 |      1,813        1.37       28.77
     2010m9 |      1,813        1.37       30.14
    2010m10 |      1,813        1.37       31.52
    2010m11 |      1,813        1.37       32.89
    2010m12 |      1,813        1.37       34.26
     2011m1 |      1,813        1.37       35.64
     2011m2 |      1,813        1.37       37.01
     2011m3 |      1,813        1.37       38.38
     2011m4 |      1,813        1.37       39.76
     2011m5 |      1,813        1.37       41.13
     2011m6 |      1,813        1.37       42.51
     2011m7 |      1,813        1.37       43.88
     2011m8 |      1,813        1.37       45.25
     2011m9 |      1,813        1.37       46.63
    2011m10 |      1,813        1.37       48.00
    2011m11 |      1,813        1.37       49.37
    2011m12 |      1,813        1.37       50.75
     2012m1 |      1,813        1.37       52.12
     2012m2 |      1,813        1.37       53.49
     2012m3 |      1,813        1.37       54.87
     2012m4 |      1,813        1.37       56.24
     2012m5 |      1,813        1.37       57.61
     2012m6 |      1,813        1.37       58.99
     2012m7 |      1,813        1.37       60.36
     2012m8 |      1,813        1.37       61.74
     2012m9 |      1,813        1.37       63.11
    2012m10 |      1,813        1.37       64.48
    2012m11 |      1,813        1.37       65.86
    2012m12 |      1,813        1.37       67.23
     2013m1 |      1,813        1.37       68.60
     2013m2 |      1,813        1.37       69.98
     2013m3 |      1,813        1.37       71.35
     2013m4 |      1,813        1.37       72.72
     2013m5 |      1,813        1.37       74.10
     2013m6 |      1,813        1.37       75.47
     2013m7 |      1,813        1.37       76.85
     2013m8 |      1,813        1.37       78.22
     2013m9 |      1,813        1.37       79.59
    2013m10 |      1,813        1.37       80.97
    2013m11 |      1,813        1.37       82.34
    2013m12 |      1,813        1.37       83.71
     2014m1 |      1,813        1.37       85.09
     2014m2 |      1,813        1.37       86.46
     2014m3 |      1,813        1.37       87.83
     2014m4 |      1,813        1.37       89.21
     2014m5 |      1,554        1.18       90.38
     2014m6 |      1,813        1.37       91.76
     2014m7 |      1,813        1.37       93.13
     2014m8 |      1,813        1.37       94.51
     2014m9 |      1,813        1.37       95.88
    2014m10 |      1,813        1.37       97.25
    2014m11 |      1,813        1.37       98.63
    2014m12 |      1,813        1.37      100.00
------------+-----------------------------------
      Total |    131,990      100.00

. disp 12*6+1
73

. disp 73*7
511

. disp 510-1 +1
510

. tab mkt

group(scant |
rack_market |
      _code |
    date_m) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        235        0.18        0.18
          2 |        259        0.20        0.37
          3 |        259        0.20        0.57
          4 |        259        0.20        0.77
          5 |        259        0.20        0.96
          6 |        259        0.20        1.16
          7 |        259        0.20        1.36
          8 |        259        0.20        1.55
          9 |        259        0.20        1.75
         10 |        259        0.20        1.94
         11 |        259        0.20        2.14
         12 |        259        0.20        2.34
         13 |        259        0.20        2.53
         14 |        259        0.20        2.73
         15 |        259        0.20        2.93
         16 |        259        0.20        3.12
         17 |        259        0.20        3.32
         18 |        259        0.20        3.51
         19 |        259        0.20        3.71
         20 |        259        0.20        3.91
         21 |        259        0.20        4.10
         22 |        259        0.20        4.30
         23 |        259        0.20        4.50
         24 |        259        0.20        4.69
         25 |        259        0.20        4.89
         26 |        259        0.20        5.08
         27 |        259        0.20        5.28
         28 |        259        0.20        5.48
         29 |        259        0.20        5.67
--Break--
r(1);

. levelsof mkt
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40
>  41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76
>  77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 10
> 9 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 13
> 6 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 16
> 3 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 19
> 0 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 21
> 7 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 24
> 4 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 27
> 1 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 29
> 8 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 32
> 5 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 35
> 2 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 37
> 9 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 40
> 6 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 43
> 3 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 46
> 0 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 48
> 7 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510

. disp 510-1+1
510

. restore

. preserve

. count if NYC == .
    0

. drop mkt

. egen mkt = group(date_m NYC)

. sort product NYC date_m
--Break--
r(1);

. bys product mkt (avg_price): keep if _n == 1
(16696435 observations deleted)

. sort product NYC date_m

. restore

. drop avg_price

. preserve

. do "C:\Users\garre\AppData\Local\Temp\STD0b000000.tmp"

.         drop mkt

.         egen mkt = group(date_m NYC)

.         egen avg_price = mean(price), by(product mkt)
(10311110 missing values generated)

.         
.         bys product mkt (avg_price): keep if _n == 1
(16696435 observations deleted)

. 
end of do-file

. sort product NYC date_m

. tab scantrack_market_code if NYC == 1

scantrack_m |
 arket_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          9 |         68      100.00      100.00
------------+-----------------------------------
      Total |         68      100.00

. restore

