
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.0   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

5-user Stata network perpetual license:
       Serial number:  401406249371
         Licensed to:  LAITS
                       The University of Texas at Austin

Notes:
      1.  Stata is running in batch mode.

Stata version 14
Stata version 11, has moved to /opt/stata11
      2.  Unicode is supported; see help unicode_advice.

. do "match_upc_to_prices.do" 

. capture log close

. clear

. set more off

. version 14

. 
. log using "match_upc_to_prices.txt", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/gh8728/Liquor/Data/combined/match_upc_to_prices.txt
  log type:  text
 opened on:  24 Jun 2016, 13:50:32

. 
. /* This file matches the nielsen UPCs to the NYS price schedule data.
> This uses the hand-checked UPC crosswalk file to do the match. The
> match quality depends on the extent of the mathing. That is, as more 
> products are matched by hand the quality does up. */
. 
. /* importing hand matches */
. import delimited using upc_crosswalk_checked.csv
(8 vars, 581 obs)

. keep if checked == 1 // keeping hand checked records
(304 observations deleted)

. 
. drop similscore neg_similscore brand_string* notes

. 
. /* merging top_1000_upc info back in */
. local upc_file = "../Nielsen_Panel/analysis/top_1000_upcs.dta"

. merge 1:1 upc_id using `upc_file', keep(3) gen(_merge_upcs)
(note: variable upc_id was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               277  (_merge_upcs==3)
    -----------------------------------------

. 
. 
. local price_sched_file = "../NY_price_schedules/old_format_months.dta"

. preserve

.         use `price_sched_file', clear

.         drop _merge

.         reshape wide disc_p disc_q disc_dollars actual_p tariff norm_p norm_t
> ariff, i(record_num) j(option)
(note: j = 0 1 2 3 4 5 6 7 8 9 10 11)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                  1.1e+06   ->  319533
Number of variables                  33   ->     109
j variable (12 values)           option   ->   (dropped)
xij variables:
                                 disc_p   ->   disc_p0 disc_p1 ... disc_p11
                                 disc_q   ->   disc_q0 disc_q1 ... disc_q11
                           disc_dollars   ->   disc_dollars0 disc_dollars1 ... 
> disc_dollars11
                               actual_p   ->   actual_p0 actual_p1 ... actual_p
> 11
                                 tariff   ->   tariff0 tariff1 ... tariff11
                                 norm_p   ->   norm_p0 norm_p1 ... norm_p11
                            norm_tariff   ->   norm_tariff0 norm_tariff1 ... no
> rm_tariff11
-----------------------------------------------------------------------------

.         tempfile ps

.         save `ps'
file /tmp/St27555.000002 saved

. restore

. 
. merge m:1 record_num using `ps', keep(3) gen(_merge_ps)
(note: variable record_num was long, now double to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               277  (_merge_ps==3)
    -----------------------------------------

. 
. local purchases "../Nielsen_Panel/analysis/blp_sample.dta"

. merge 1:m upc upc_ver_uc using `purchases', gen(_merge_purchases) keep(3)
(label _merge already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,151  (_merge_purchases==3)
    -----------------------------------------

. 
. save merged_blp_sample, replace
file merged_blp_sample.dta saved

. 
. log close
      name:  <unnamed>
       log:  /home/gh8728/Liquor/Data/combined/match_upc_to_prices.txt
  log type:  text
 closed on:  24 Jun 2016, 13:51:09
-------------------------------------------------------------------------------

. 
end of do-file
